{
    "specials": [
        {
            "name": "Nest Hello Video Doorbell",
            "Description": "Featured in Ellens November List, the Nest Hello Video Doorbell let's you know who is at the door so you don't miss a thing. It replaces your existing wired doorbell and delivers HD video with bright, crisp images, even at night. It's designed to show you everything at your doorstep. You can see people head-to-toe or packages on the ground. It features a Familiar Face Alert that sends you a notification if your camera sees a family member - or a stranger. You can also pre-record quick responses and, with 24/7 streaming, you can check in anytime. You can also go back and look at a three hour snapshot history to see what happened at your front door. Just like Ellen said, you can “conquer the holiday season” with the Nest Hello Video Doorbell.",
            "targetPrice": 132.46,
            "walmartPrice": 120.00,
            "costcoPrice": 99.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcSNRpxCkfN8XIq4VhivIHwT7wwpuDXGoWileaGitbSWR4beVYyjPESZI461EiO7-2N6n_1pQ-czb4Hbd22Rp8m9bQSFa8ojgN2f1owIZuBvLcmZ0bhufN_FVYo"
        },
        {
            "name": "Barbie - Dreamhouse Playset",
            "Description": "Open the door to the new Barbie Dreamhouse for unlimited storytelling possibilities! Standing 109cm tall and 104cm wide, this dreamy dollhouse inspires 360-degree play with three floors and 10 indoor and outdoor living areas. There's so much to explore.Create Your Dream Dollhouse Move right in and customize the space  the grass area and pool can be placed in multiple configurations on the first and third floors. Plus, the slide in your Barbie Dreamhouse fits in four second-floor locations. Play out any story, from an ordinary day to the ultimate get-together with a kitchen, living room, dining room, bedroom, bathroom, pool, balcony, party room and moreInteractive Dolls House Let your Barbie Dreamhouse set the scene for any story with three songs, two soundscapes and customisable light settings! The transforming furniture doubles the fun, too. The BBQ grill reverses to reveal a dessert buffet, the entertainment center reverses to reveal a pet play area, and a bunk bed folds down from the wall. Lift and lower Barbie doll and her friends in the working elevator. Dolls, vehicle and wheelchair not included.",
            "targetPrice": 199.99,
            "walmartPrice": 149.99,
            "costcoPrice": 175.69,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcTvAL0V280Vf5RnYOXbKzNlv8LTGZHI5zCiNG-sHIC5NTLVab7a&usqp=CAY"
        },
        {
            "name": "Samsung 65 Class S95B 4K OLED Smart TV",
            "Description": "The Samsung 65 Class S95B OLED 4K Smart Tizen TV changes the game again with 8.3 million self-lit pixels and ultra-powerful 4K AI Neural Processing, all for a picture so real, its surreal. Add on Dolby Atmos sound built-in, the latest Smart TV apps, and a LaserSlim design, and get a viewing experience thats intensely cinematic. Samsung OLED Technology With 8.3 million specially designed self lit pixels inside the screen, this picture is intensely cinematic. Neural Quantum Processor with 4K Upscaling Experience everything you watch transformed to 4K by 20 AI powered neural networks. Quantum HDR OLED Hollywoods HDR movies and streaming shows leap off the OLED screen with unimaginable details. Dolby Atmos and Object Tracking Sound Be enveloped by the spectacular cinematic surround sound of Dolby Atmos built right into the TV. LaserSlimDesign Daringly discreet, this stylish TV has a profile so thin it was inspired by a laser beam. Smart TV Hub Spend less time searching and more time streaming what you enjoy with Smart TV Hub. Motion Xcelerator Turbo + (4K @120Hz) Action movies, sports and games look smooth and fluid up to 4K at 120Hz. Smart Calibration Enjoy your screen the way the director intended in just a couple of clicks Real Depth Enhancer Experience depth and dimension on screen just like you do in real life. Eye Comfort Mode From day to night, the amount of blue light automatically adjusts for your eyes.",
            "targetPrice": 1799.99,
            "walmartPrice": 1797.99,
            "costcoPrice": 1844.00,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcQvUEzau_7_J2IqAzgoSfqrveMxVSvR4NNZarMNkQj-jd-HV6rCW1ze74VeRyCTQV2e3stc8jqd9cXpPW-pyDqMknCkaf4yaaUo33xCXVTdJTPAyjhlP3P0Mw"
        },
        {
            "name": "Apple Watch SE GPS",
            "Description": "   + With powerful features to help keep you connected, active, healthy, and safe. + Take calls and reply to texts, right from your wrist. + Track your daily activity on Apple Watch, and see your trends in the Fitness app on iPhone. + Track new tai chi and pilates workouts, in addition to favorites like running, yoga, swimming, and dance. + Stay on top of your health with high and low heart rate, and irregular heart rhythm notifications.",
            "targetPrice": 229.00,
            "walmartPrice": 199.00,
            "costcoPrice": 215.00,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcRfYA4Y0GnAuXKSwChxqxRyMvpbMcATl2rYHm9ZyKPpE0DGx50ergxIxDEx5P9gOg3tkYHzseLzsB7fcmXmNX14DSk86v7q"
        },
        {
            "name": "DJI Air 2S Fly More Combo Drone",
            "Description": "The compact and foldable design of the DJI Air 2S Fly More Combo Drone lets you easily capture breathtaking aerial images and video whenever the mood strikes. It's an ideal alternative for use when travelling on vacation or for photography enthusiasts looking to record from new and unique perspectives. Piloting is made to be easy and intuitive via your smartphone and the DJI Fly app. Simply slip your phone into the included remote controller. Thanks to the Air 2S 3-axis gimbal, four remote antennae, and OcuSync 3.0 technology, you can receive a stable, live view from the drone up to 7.5 miles away.Less",
            "targetPrice": 1229.00,
            "walmartPrice": 1199.00,
            "costcoPrice": 1215.00,
            "image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcTWkCww5uvvSHxQ14k_9jzHzkQSrx1fx7zracRlvOiNJrHPYLik1SHcjNL_micYxK06DXFpLedq9aZrPGBtl79ttRGiisiO1w&usqp=CAY"
        },
        {
            "name": "AMD Ryzen 7 5800x3d 8 Core Processor",
            "Description": "Unbeatable gamers power their play with the superior speed of the world's best desktop processors. AMD Ryzen 5000 Series processors deliver maximum performance, whether you're playing the latest games or designing them. Play the most demanding games and power through 3D or video rendering with AMD Ryzen 5000 Series desktop processors. Get an edge in the game with advanced technologies from AMD like a Precision Boost 2 and Precision Boost Overdrive. Performance meets efficiency in the 7nm “Zen 3” core at the heart of these processors, so your rig stays cool under pressure. With PCIe 4.00, you can maximize graphics and storage bandwidth.",
            "targetPrice": 319.99,
            "walmartPrice": 379.00,
            "costcoPrice": 345.59,
            "image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcSG17VGTBW4lJQZJv49r3M3lfdj8-6mcsaiEIWJXvhaiCTS0dT1-xwjPajj0kXqaMITwzyly4Zb1mv4t5Fa8HKyK6aQkoJvNWFR1BmTFl_hL6UuzID-p1OicA"
        },
        {
            "name": "Magic Mixies Blue Interactive Plush Toy Magical Misting Cauldron",
            "Description": "Experience real magic - just mix your potion and make your pet! Who will you magically create? Includes all magic ingredients you need and a special Wand to mix a potion and make a cute furry friendbe amazed as your Magic Mixie appears through the mist! Follow the spell by adding the magical ingredients to your Cauldron one step at a time, waiting for the green light and tapping 3 timeswhen the potion is finished watch as REAL MIST begins to rise from the Cauldron. So adorable and so interactive, your Magic Mixie reacts to your touch and responds to your wand - they love to perform spells with you and may even grant you a wish! Comes with 50+ sounds and reactions from the Cauldron and your Magic Mixie! You can make real Magic happen again and again! Your Magic Mixie can be reloaded back into the Cauldron so you can repeat the spell and mist for your friends! Or, reveal your own toys using the included Gem Case. You can even make your own unique potions and spells using the second Spell Mode of play. The Magic Mixies Magic Cauldron Refill Pack (sold separately) is also available and contains enough ingredients to create 2 new spells and 20+ misting moments, so you can repeat the magical reveal again and again.",
            "targetPrice": 74.99,
            "walmartPrice": 69.28,
            "costcoPrice": 56.04,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcTpEhYVirIJRFjy77Fj4XQPoib-QJHr-4CV2wpNSAHQ19WLpkZ1tKgQKFJyiG9cTstvReeMPpCRkSmbHyTBwXJ0aCkAtX4T7NF-dloKnJTfTfeuqrv3bB2l"
        },
        {
            "name": "JBL - Flip 5 Bluetooth Portable Waterproof Speaker, BLACK.",
            "Description": "Take the party with you wherever you go with the ocean blue JBL Flip 5 Waterproof Bluetooth Speaker. The Flip 5 uses Bluetooth connectivity to stream music from your compatible devices such as smartphones and tablets. With 20W of audio power and its racetrack-shaped driver this speaker delivers high audio output. With its IPX7 waterproof rating you can take this speaker to the beach or pool without fear of getting it wet and its material of construction makes it tough and durable. The Flip 5 gives you more than 12 hours of battery life so you can listen to your favorite tunes all day. With JBL PartyBoost you can pair two JBL PartyBoost compatible speakers together for an enhanced sound experience. The built-In 4800mAh rechargeable LiPo battery supports up to 12 hours of playtime and can be recharged in up to 2.5 hours. Made with a durable fabric material and rugged rubber housing this speaker is designed to be safe inside or outdoors.",
            "targetPrice": 74.99,
            "walmartPrice": 69.28,
            "costcoPrice": 72.04,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcQz5WYVCBYvRebqohVO1K5tXPPPTT4syjL0qroL4p4j8KrHkynjxRPfF22WJ3e1p4-gRdGT61NYEogTo7U-KkmFRKK8VDA0Bt855k1aE7I"
        },
        {
            "name": "Samsung Galaxy A53 5G Unlocked Android Smartphone, 128gb. Black",
            "Description": "Time to get to work. Powered with a 5nm Octa-core processor, your Galaxy is built to handle heavy-duty multitasking. RAM Plus reads your usage patterns and provides extra virtual RAM for an additional boost. It's a whole lot. With 128GB of internal storage plus support for a microSD card up to 1TB, you've got room for all your precious moments. The Galaxy A53 5G is designed to stand out. With the Ambient Edge blending the camera with the body seamlessly, your Galaxy is entirely beautiful and fully functional with added battery capacity inside a slim, matte frame. Feast your eyes on vibrant details with the FHD+ Super AMOLED display. With the expansive 6.5-inch Infinity-O Display, enjoy vivid outdoor visibility up to 800 nits¹ while reducing blue light with the Eye Comfort Shield Watch anything on your Galaxy's 120Hz Super AMOLED display to see how silky smooth is now a viewing experience with less blur, more details, and vivid contrast. The multi-lens camera on the Galaxy A53 5G takes photos to the next level. Get crisp, clear shots with the 64MP OIS Camera, expand your viewing angle with the Ultra Wide Camera, customize focus with the Depth Camera and get closer to details with the Macro Camera. Capture your funniest moments with new Snapchat Lenses updated regularly on Fun mode. Browse and try on your favourites, capture your best look and share them with your friends. With bokeh effects and dual lenses for a depth camera powered by AI, you can capture the fine attributes that make every face unique. Blur out the background and focus on the details that brings the life out from inside the frame. A 5,000mAh (typical)² battery for more time streaming, sharing, gaming and more. Quickly revive your Galaxy with up to 25W Super Fast Charging and enable adaptive power saving to enhance the overall battery performance.",
            "targetPrice": 449.99,
            "walmartPrice": 399.00,
            "costcoPrice": 299.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcSGkwVYLmM5RGpfWrp--LoqVZ8EmXSPKEzWDLArGfc1iXTlBx0mlEw5vB9WXXPyIvHili0desqA-GaFvlsfT-NfGb1mNJwa4y6P7c1HOiV7B2OTxlrADAP3Gw"
        },
        {
            "name": "32GB Samsung Galaxy Tab A8 10.5 inch Tiger 3GB Android 11 Tablet - Dark Grey",
            "Description": "Immerse yourself in movies, TV shows, and games with the 10.5 Samsung Galaxy Tab A8 32GB Tablet. Available in a stylish dark gray color, this tablet is delivers big picture entertainment with its 10.5 1920 x 1200 resolution touchscreen display and narrow bezel design. The screen is backed by four speakers that support Dolby Atmos to enhance your movie experience with virtual surround sound. Inside is a Unisoc T618 eight-core processor with 3GB of memory, providing the power to multitask a variety of apps and games. With its 32GB storage capacity, you'll have room to store your photos and videos as you capture every moment using the 8MP front-facing and 5MP rear cameras. You can expand your storage by installing an optional microSD card, up to 1TB capacity, into the available slot. Connect to compatible 802.11ac networks to share your content, browse social media, and play online games. Android 11 is the installed operating system.",
            "targetPrice": 149.99,
            "walmartPrice": 147.99,
            "costcoPrice": 149.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcSH0MhktbvzIqQJUAoKHWT_YtSkhQfT25iMDEemOfB-OgrJ5yBfOJ2SL0Dmn3HOcm4QkFxgCIu77f__b-YkmF0HQdj1MHfA&usqp=CAY"
        },
        {
            "name": "Apple 10.2-inch iPad Wi-Fi + Cellular 64gb",
            "Description": "The Apple 10.2-Inch 64GB iPad is powerful and easy to use. This new iPad has a beautiful 10.2-inch Retina display, a powerful A13 Bionic chip, an Ultra Wide front camera with Center Stage, and works with Apple Pencil and the Smart Keyboard. It is designed for all the things you love to do. Work, play, create, learn, stay connected, and more. Revie",
            "targetPrice": 459.99,
            "walmartPrice": 399.99,
            "costcoPrice": 399.99,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcSvv0wAtjyL2bpEWZsk2oxDGM9g_Q7ZbuqU2bOigimHDOvMO6QDgpLtGsDfyII8OdSBGYIic2gYFizwoPecPRaU1FFXT8Deq5aqB1r2wOCW"
        },
        {
            "name": "Breville Bambino Espresso Machine, Stainless Steel",
            "Description": "The faster way to professional results at home. Like professional machines, the Bambino can deliver third wave specialty coffee. This is made possible by the 4 keys formula. Delivering barista quality performance using a 54mm porta filter with 18 grams of coffee for full flavor and a powerful steam wand to create micro foam required for latte art. With a proprietary Thermo jet heating system the machine is ready to start in 3 seconds.",
            "targetPrice": 279.99,
            "walmartPrice": 279.99,
            "costcoPrice": 349.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcR7wVabBWuJ86npXmusynBK0t9qLuO1Csu-S4Nb6dn15dCT3f7Ye8WPiSMylQHcsbsCFyALYi3qKwJqLYrQWKoDQ_BcMFX7IlfmDLLeHCAy_XvPqUX0M3DI-w"
        },
        {
            "name": "PS5 Preorder Elden Ring - PlayStation 5 | Sony ",
            "Description": "Explore a sprawling realm filled with peril and wonder in ELDEN RING for PlayStation 5. As you move from its furthest reaches right to its lowest depths, stay alert to fight opponents that lurk in unsuspecting corners in this RPG action game. Experience the ultimate gaming experience as you unravel the rich and bloody history of ELDEN RING. Reviews",
            "targetPrice": 59.00,
            "walmartPrice": 52.99,
            "costcoPrice": 52.99,
            "image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcQrO2gQ1mR3JyzwyggIhIvknAuar3DdVAJK3N1Rqpzo0vsTkqBaYgwXBkWQZwIr_R0lbI-W3-o__rS1_RIKtVlf5mIF4CN7k6RfMh19AbCdj7_Pxn2IYI9k"
        },
        {
            "name": "Brookstone 3-in-1 Robo Vacuum, Black",
            "Description": "MULTIFUNCTIONAL: Unique 3-in-1 design allows you to simultaneously sweep, vacuum, and mop for the ultimate surface clean. ADVANCED SENSORS: Enhanced sensors scan constantly to detect and avoid obstacles and furniture while effectively cleaning your home.",
            "targetPrice": 199.99,
            "walmartPrice": 69.99,
            "costcoPrice": 152.99,
            "image": "https://s.yimg.com/lo/api/res/1.2/s13b5jkWFOyh2tLdGxRMOg--/YXBwaWQ9ZWNfaG9yaXpvbnRhbDtoPTQwMDtzcz0xO3c9NDAw/https://d6.cnnx.io/image/obj/21874580910;sq=400;p=0;t=ooPwmM0WTWKbBA1VCUs_f-_oll5vnJmf4_2mLN5b0dhkSuFG0RHK7fQKvGxqRMrNWaPhnksi-klzjnmjoPOBnxyCnTwmC3ZC3tF3nj5wwcRq9QOkUCgBPe-Kww==.cf.jpg"
        },
        {
            "name": "Lenovo Legion 5 Pro 16 Gaming Laptop, QHD 165Hz, AMD Ryzen 7, NVIDIA GeForce RTX 3070",
            "Description": "Operating system: Windows 11 Home Processor: AMD Ryzen 7 5800H Display: 16” QHD IPS LCD w/ LED Backlight 100% sRGB (Anti-glare) 165Hz, HDR 400 Memory: 16GB DDR4 3200MHz Internal storage: 512GB NVMe TLC SSD Graphics: NVIDIA GeForce RTX 3070 Optical Drive: None Audio: 2 x 2W Speakers Battery life: Up to 4.2 Hours Wireless: 2 x 2 802.11AX Wi-Fi with Bluetooth 5 Webcam: 720P Camera and dual array Microphone Product weight: 5.39 lbs Color: Storm Grey",
            "targetPrice": 1429.59,
            "walmartPrice": 1298.67,
            "costcoPrice": 1099.89,
            "image": "https://s.yimg.com/lo/api/res/1.2/AsZYSg1S9uoVHXGsSByRwQ--/YXBwaWQ9ZWNfaG9yaXpvbnRhbDtoPTQwMDtzcz0xO3c9NDAw/https://i5.walmartimages.com/asr/0e3c1612-1a7f-41ec-91f9-c2b9f3cac1fd.8441ec1bab6f971d522646dbbdf32896.jpeg"
        },
        {
            "name": "Aquasonic Black Series Ultra Whitening Toothbrush",
            "Description": "40,000 VPM Smart Toothbrush - Beauty, brains and power. The Black Series is a world class modern electric toothbrush packed with the most up to date technology. It features an ultra-powerful and industry leading motor producing 40,000 vibrations per minute , lithium-ion battery, ultra-fast wireless charging, 4 mode operation, smart vibration timers, 8 DuPont engineered brush heads and bristles, and a custom travel case; all with a sleek ultra-slim, lightweight and IPX7 rated waterproof design. ",
            "targetPrice": 59.94,
            "walmartPrice": 38.47,
            "costcoPrice": 24.95,
            "image": "https://target.scene7.com/is/image/Target/GUEST_4d475e37-5440-481c-a943-b31a84a8cdb6?wid=2220&hei=2220&fmt=pjpeg"
        },
        {
            "name": "Dyson V8 Origin Vacuum",
            "Description": "Powerful Dyson suction and lightweight for quick cleaning. Without the cord. Engineered for homes with pets. Removes dirt, allergens and pet hair around your home. Up to 40 minutes of run time: Battery-saving trigger helps maximize energy-efficiency, only using power when you need it. Actual run time will vary based on power mode and/or attachments used. De-tangling Motorbar™ cleaner head: Deep cleans carpets and hard floors with hair removal vanes to clear long hair and pet hair from the brush bar",
            "targetPrice": 299.99,
            "walmartPrice": 499.99,
            "costcoPrice": 350.89,
            "image": "https://target.scene7.com/is/image/Target/GUEST_d209f5d0-0185-4799-9cee-8ed80f27a8d7?wid=2220&hei=2220&fmt=pjpeg"
        },
        {
            "name": "Sony PlayStation 5 - Standard",
            "Description": "Integrated I/O: Marvel at incredible graphics and experience new PS5 features.Ultra-high speed SSD: Maximize your play sessions with near-instant load times for installed PS5 games. HDR technology: With an HDR TV, supported PS5 games display an unbelievably vibrant and lifelike range of colors. 8K output: PS5 consoles support an 8K output, so you can play games on your 4320p resolution display. 4K TV gaming: Play your favorite PS5 games on your stunning 4K TV. Up to 120 fps with 120Hz output",
            "targetPrice": 499.99,
            "walmartPrice": 489.99,
            "costcoPrice": 489.99,
            "image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcSbKnqqdMH6hYKh8mzk9kje2m3KI-bRktHWihZ_LYAHQF0BNIXyfzjjusW0XMVpuUk13pFiHLVztP7Rk7GDgxBUnC6hFY84sQ&usqp=CAY"
        },
        {
            "name": "3in1 Foldable Exercise Bike Indoor Cycling Bike Magnetic Stationary Bike Fitness Gym Workout",
            "Description": "Did you know you can burn 200-300 calories just by riding 30 minutes on your Cycool Indoor Exercise Bike, this is one easy way to lose weight in the comfort of your home! Consider when it is bad weather, Cycool folding exercise bike can be your great sport partner! Now you can enjoy exercising anytime in the comfort of your living. It features a Phone Holder, 8 Levels of Magnetic Resistance, and a LCD Screen to track your fitness results! Plus, it also has a twister and two resistance bands, now you can finish a whole body exercise!",
            "targetPrice": 249.99,
            "walmartPrice": 175.89,
            "costcoPrice": 210.25,
            "image": "https://i5.walmartimages.com/asr/56f7e261-2e02-42e6-9cc1-5c9b74009568.5eb223c9dc372f62d79521392bbe6043.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF"
        },
        {
            "name": "Blackstone ProSeries 2-Burner Griddle Cooking Station with Hood",
            "Description": "Two independently controlled cooking zones 30,000 BTUs Steel griddle top Stainless steel tube burner Industrial strength wheels Rear grease management system Convenient paper towel holder Side shelf hooks for griddle tools Magnetic tool bar for easy access Two side shelves Griddle hood",
            "targetPrice": 274.00,
            "walmartPrice": 248.99,
            "costcoPrice": 302.56,
            "image": "https://s.yimg.com/lo/api/res/1.2/fnyyopVdwjeqNNYs5h47HA--/YXBwaWQ9ZWNfaG9yaXpvbnRhbDtoPTQwMDtzcz0xO3c9NDAw/https://i5.walmartimages.com/asr/c75f1001-c9e5-4d44-8ffe-ac5a1b1b4c4e_1.1357189b2b616d1f4e13701028e902ef.jpeg"
        },
        {
            "name": "Canon - PIXMA MG3620 Wireless All-In-One Inkjet Printer",
            "Description": "Canon PIXMA MG3620 All-in-One Printer: Effortlessly complete office tasks with this versatile printer, which lets you print, copy and scan photos and documents. You can even create borderless photos and print directly from your mobile device via built-in Wi-Fi.",
            "targetPrice": 82.99,
            "walmartPrice": 99.99,
            "costcoPrice": 69.99,
            "image": "https://lh3.googleusercontent.com/spp/AM1yTs6_FUEco4ekexfmZYiMnE_T1K3n0V6FTNZvIeIPVFd2MHbB4xz-n6bOrw0vPCZ6JBbxNRfEyrgyxLk86sgFz2Y5JasBnSsv4hOcTWu18dfIj4LWYRML-j9BzNMGatS6vQMkZ1C_KGNGLJGI80TpQXYzvU3M7FF58abbp9r8UEa283yZJw0tNIV5LC1drOReQNuqK0ZSwQ=s512-pd-pc0x00ffffff"
        },
        {
            "name": "Versace Eros Eau de Toilette Men Spray",
            "Description": "TOP NOTES This Versace perfume is for those men who defend their goals and ideas. It opens up with the refreshing and green accords of mint, so you can start your day with a boost of freshness. Furthermore, the mouthwatering fruity note of green apple combines perfectly with the bright, cheerful aroma of Italian lemon to give you a lively presence. Eros for men MIDDLE NOTES The heart of the Eros perfume consists of tonka beans, geranium flowers, and Venezuelan ambroxan. The presence of tonka beans adds a sense of positivity to your senses. Furthermore, the rosy nuance of geranium flowers gives off a charming impression to impress your special someone. This Ambroxan notes combine well with the heart notes to give this perfume a distinctive character. Eros for men BASE NOTES Eros for men has a captivating base that speaks volumes about your taste in fragrances. The blend of vanilla and oakmoss give out a cozy aroma that keeps you comfortable and relaxed. Furthermore, the woody scent of vetiver, Virginian cedar, and Atlas cedar give you a masculine and mature presence.",
            "targetPrice": 75.00,
            "walmartPrice": 50.99,
            "costcoPrice": 54.19,
            "image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcTq5JIXvQudZ1tHEcnQHUcHJSejx-AVbJWITZ-T45OCnx3nTGfWww34S56ZCiCaUXtprfGnRFPUbtv7HPOMR3mFpfYaM7KyZaFgH-flfAgIwPfenYPClEaX"
        }
    ],
    "Electronics": [
        {
            "name": "Apple iPhone 13 Pro Max 128GB Graphite",
            "Description": "iPhone 13 Pro Max. The biggest Pro camera system upgrade ever. 6.7-inch Super Retina XDR display¹ with ProMotion for a faster, more responsive feel. Lightning-fast A¹⁵ Bionic chip. Superfast ⁵G.² Durable design and industry-leading IP⁶⁸ water resistance.³ And a huge leap in battery life. See Features ¹The display has rounded corners that follow a beautiful curved design, and these corners are within a standard rectangle. When measured as a standard rectangular shape, the ⁶.⁷-inch screen is ⁶.⁶⁸ inches diagonally. Actual viewable area is less.²Data plan required. ⁵G is available in select markets and through select carriers. Speeds vary based on site conditions and carrier. For details on ⁵G support, contact your carrier and see apple.com/iphone/cellular.³iPhone ¹³ Pro Max is spill, splash, and dust resistant and was tested under controlled laboratory conditions with a rating of IP⁶⁸ under IEC standard ⁶⁰⁵²⁹. Spill, splash, and dust resistance are not permanent conditions. Resistance might decrease as a result of normal wear. Do not attempt to charge a wet iPhone; refer to the user guide for cleaning and drying instructions. Liquid damage not covered under warranty.",
            "targetPrice": 1250.00,
            "walmartPrice": 999.99,
            "costcoPrice": 1300.00,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcSVXvN--Q_pPn7cnxIlmEfSXn_ryIEJ67Zc9-s2JW3jmu24VpcjgYAVp4lvmdMGrGGGoShxDv2sCzSy7QUZvJoqs-vqSuaiEQ&usqp=CAY"
        },
        {
            "name": "Samsung Galaxy A13 5G 64gb Black",
            "Description": "LONG-LASTING BATTERY: Whatever your day has in store, this mobile phone's 15W Fast Charging battery makes sure you're ready for it and gives your charger a break.Maximum display resolution:1920 x 1080 pixels.Display Type:LCD.Form_factor : Smartphone.Display resolution maximum:1920 x 1080 pixels. ENHANCED 5G PERFORMANCE: Say goodbye to buffering and hello to quick downloading and smooth streaming; Outfitted with a fast and reliable processor, Galaxy A13 5G gives you a virtually lag-free 5G experience. EXPANDABLE STORAGE: Make the most out of your memories; It comes loaded with 64GB of internal memory, with room for up to 1TB more when you add a microSD card. TRIPLE LENS CAMERA: With a high-res triple lens camera system, Galaxy A13 5G gives you one of our most sought-after cameras at a fraction of the price. Main Display Resolution: 720 x 1600 (HD+)",
            "targetPrice": 229.24,
            "walmartPrice": 148.49,
            "costcoPrice": 175.84,
            "image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcR-qgeI7hqcH66Rk5wLgOW8mcft0FJjiLUGJqt9xRcXoqgGsReLrnagrzn5mLF9rCeG40fS87GxWKku-oSHE6loxjYoVDkLvcE0FZDYoxrVRY7Uk3L7y_YqMg"
        },
        {
            "name": "Google Pixel 7 Pro 5G",
            "Description": "",
            "targetPrice": 899.99,
            "walmartPrice": 1044.98,
            "costcoPrice": 850.47,
            "image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcTCYxwT28ev22cFjW7MhE0oWfQFTRXdsciRDP3C9OjyI5S8ejGMOVmCoZ1zpJB33jP9biWMWkKCGiGz242Yhr7LR5sfmvjBK1Glk5-e1azVzrQrlgKHi-Xx"
        },
        {
            "name": "Apple iPad 9th Gen.",
            "Description": "The tablet uses an Apple iPadOS 15 operating system and Apple A13 Bionic processor. It also has two cameras with 8 and 12 megapixels on the front and back respectively. The 9th generation tablet boasts a screen size of 10.2 inches with a display resolution of 1920 x 1080. It uses a Lithium Polymer battery with 32.4Wh capacity giving you up to 10 hours of continuous run time. Other notable features on the Apple iPad 9th Gen Wifi US Space Gray include a fingerprint reader and an aluminum casing. The Apple iPad 9th Gen Wifi US Space Gray was first made available for retail at the price of $330 in September 2021.",
            "targetPrice": 229.99,
            "walmartPrice": 269.99,
            "costcoPrice": 288.89,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcRTkoG0N-ecuvX_0jJRPApOnCTu1L8Jm2Au_2NK3-kKt4RNjp_s1TikEQbUnujMJfOZbXC8QCpyt7cAAYhu-yOC1ExEqGkqhWYCR1gmexTuSK1uA6oE4tYV"
        },
        {
            "name": "Amazon - Fire HD 10 Plus",
            "Description": "Enjoy up to 12 hours of reading, browsing the web over Wi-Fi, watching videos and listening to music from anywhere with the Amazon Fire HD 10 Plus Tablet. Equipped with 4 GB of RAM, an octa-core processor and a brilliant and vibrant 10.1-inch 1080p Full HD display, it ensures a powerful performance. The Fire HD 10 Plus switches to Show Mode in the dock so you can use it hands-free with Alexa responses you can see and hear.",
            "targetPrice": 179.99,
            "walmartPrice": 129.99,
            "costcoPrice": 119.99,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcTtagWjBOC9SNSvi4bTpWzw7IdiLn2uw5y9g8ogA513LKY1Q31J5KQ4ESQkpJ9ZECjzzVOKrRhFTnXo0wd0IwVZiEn-l9UuJ_9c1zXG96AA"
        },
        {
            "name": "HP Envy x360",
            "Description": "Experience the power to create any way, anywhere The HP Envy x360 15.6 has the tools to create every which way. Combine the creative power of your devices with HP Palette. With the 15.6 display, you get beautiful, brilliant colors plus power from the Intel Processor and powerful graphics. Look and sound your best on video calls with a 5MP camera with Auto Frame and AI Noise Reduction.",
            "targetPrice": 1099.99,
            "walmartPrice": 1789.96,
            "costcoPrice": 989.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcTwUQHfkhGoxQJ0olb-0kKpYhpcqNkDW0vn8djk4kaevABaR-er-hxgQed2ML_LqDRJlKLawYnnvQqRCHSPHtywxj9rGbXYinvqSAJXftynRV5WT9q50WEgEg"
        },
        {
            "name": "Nest Hello Video Doorbell",
            "Description": "Featured in Ellens November List, the Nest Hello Video Doorbell let's you know who is at the door so you don't miss a thing. It replaces your existing wired doorbell and delivers HD video with bright, crisp images, even at night. It's designed to show you everything at your doorstep. You can see people head-to-toe or packages on the ground. It features a Familiar Face Alert that sends you a notification if your camera sees a family member - or a stranger. You can also pre-record quick responses and, with 24/7 streaming, you can check in anytime. You can also go back and look at a three hour snapshot history to see what happened at your front door. Just like Ellen said, you can “conquer the holiday season” with the Nest Hello Video Doorbell.",
            "targetPrice": 132.46,
            "walmartPrice": 120.00,
            "costcoPrice": 99.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcSNRpxCkfN8XIq4VhivIHwT7wwpuDXGoWileaGitbSWR4beVYyjPESZI461EiO7-2N6n_1pQ-czb4Hbd22Rp8m9bQSFa8ojgN2f1owIZuBvLcmZ0bhufN_FVYo"
        },
        {
            "name": "Samsung 65 Class S95B 4K OLED Smart TV",
            "Description": "The Samsung 65 Class S95B OLED 4K Smart Tizen TV changes the game again with 8.3 million self-lit pixels and ultra-powerful 4K AI Neural Processing, all for a picture so real, its surreal. Add on Dolby Atmos sound built-in, the latest Smart TV apps, and a LaserSlim design, and get a viewing experience thats intensely cinematic. Samsung OLED Technology With 8.3 million specially designed self lit pixels inside the screen, this picture is intensely cinematic. Neural Quantum Processor with 4K Upscaling Experience everything you watch transformed to 4K by 20 AI powered neural networks. Quantum HDR OLED Hollywoods HDR movies and streaming shows leap off the OLED screen with unimaginable details. Dolby Atmos and Object Tracking Sound Be enveloped by the spectacular cinematic surround sound of Dolby Atmos built right into the TV. LaserSlimDesign Daringly discreet, this stylish TV has a profile so thin it was inspired by a laser beam. Smart TV Hub Spend less time searching and more time streaming what you enjoy with Smart TV Hub. Motion Xcelerator Turbo + (4K @120Hz) Action movies, sports and games look smooth and fluid up to 4K at 120Hz. Smart Calibration Enjoy your screen the way the director intended in just a couple of clicks Real Depth Enhancer Experience depth and dimension on screen just like you do in real life. Eye Comfort Mode From day to night, the amount of blue light automatically adjusts for your eyes.",
            "targetPrice": 1799.99,
            "walmartPrice": 1797.99,
            "costcoPrice": 1844.00,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcQvUEzau_7_J2IqAzgoSfqrveMxVSvR4NNZarMNkQj-jd-HV6rCW1ze74VeRyCTQV2e3stc8jqd9cXpPW-pyDqMknCkaf4yaaUo33xCXVTdJTPAyjhlP3P0Mw"
        },
        {
            "name": "Apple Watch SE GPS",
            "Description": "   + With powerful features to help keep you connected, active, healthy, and safe. + Take calls and reply to texts, right from your wrist. + Track your daily activity on Apple Watch, and see your trends in the Fitness app on iPhone. + Track new tai chi and pilates workouts, in addition to favorites like running, yoga, swimming, and dance. + Stay on top of your health with high and low heart rate, and irregular heart rhythm notifications.",
            "targetPrice": 229.00,
            "walmartPrice": 199.00,
            "costcoPrice": 215.00,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcRfYA4Y0GnAuXKSwChxqxRyMvpbMcATl2rYHm9ZyKPpE0DGx50ergxIxDEx5P9gOg3tkYHzseLzsB7fcmXmNX14DSk86v7q"
        },
        {
            "name": "DJI Air 2S Fly More Combo Drone",
            "Description": "The compact and foldable design of the DJI Air 2S Fly More Combo Drone lets you easily capture breathtaking aerial images and video whenever the mood strikes. It's an ideal alternative for use when travelling on vacation or for photography enthusiasts looking to record from new and unique perspectives. Piloting is made to be easy and intuitive via your smartphone and the DJI Fly app. Simply slip your phone into the included remote controller. Thanks to the Air 2S 3-axis gimbal, four remote antennae, and OcuSync 3.0 technology, you can receive a stable, live view from the drone up to 7.5 miles away.Less",
            "targetPrice": 1229.00,
            "walmartPrice": 1199.00,
            "costcoPrice": 1215.00,
            "image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcTWkCww5uvvSHxQ14k_9jzHzkQSrx1fx7zracRlvOiNJrHPYLik1SHcjNL_micYxK06DXFpLedq9aZrPGBtl79ttRGiisiO1w&usqp=CAY"
        },
        {
            "name": "AMD Ryzen 7 5800x3d 8 Core Processor",
            "Description": "Unbeatable gamers power their play with the superior speed of the world's best desktop processors. AMD Ryzen 5000 Series processors deliver maximum performance, whether you're playing the latest games or designing them. Play the most demanding games and power through 3D or video rendering with AMD Ryzen 5000 Series desktop processors. Get an edge in the game with advanced technologies from AMD like a Precision Boost 2 and Precision Boost Overdrive. Performance meets efficiency in the 7nm “Zen 3” core at the heart of these processors, so your rig stays cool under pressure. With PCIe 4.00, you can maximize graphics and storage bandwidth.",
            "targetPrice": 319.99,
            "walmartPrice": 379.00,
            "costcoPrice": 345.59,
            "image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcSG17VGTBW4lJQZJv49r3M3lfdj8-6mcsaiEIWJXvhaiCTS0dT1-xwjPajj0kXqaMITwzyly4Zb1mv4t5Fa8HKyK6aQkoJvNWFR1BmTFl_hL6UuzID-p1OicA"
        },
        {
            "name": "JBL - Flip 5 Bluetooth Portable Waterproof Speaker, BLACK.",
            "Description": "Take the party with you wherever you go with the ocean blue JBL Flip 5 Waterproof Bluetooth Speaker. The Flip 5 uses Bluetooth connectivity to stream music from your compatible devices such as smartphones and tablets. With 20W of audio power and its racetrack-shaped driver this speaker delivers high audio output. With its IPX7 waterproof rating you can take this speaker to the beach or pool without fear of getting it wet and its material of construction makes it tough and durable. The Flip 5 gives you more than 12 hours of battery life so you can listen to your favorite tunes all day. With JBL PartyBoost you can pair two JBL PartyBoost compatible speakers together for an enhanced sound experience. The built-In 4800mAh rechargeable LiPo battery supports up to 12 hours of playtime and can be recharged in up to 2.5 hours. Made with a durable fabric material and rugged rubber housing this speaker is designed to be safe inside or outdoors.",
            "targetPrice": 74.99,
            "walmartPrice": 69.28,
            "costcoPrice": 72.04,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcQz5WYVCBYvRebqohVO1K5tXPPPTT4syjL0qroL4p4j8KrHkynjxRPfF22WJ3e1p4-gRdGT61NYEogTo7U-KkmFRKK8VDA0Bt855k1aE7I"
        },
        {
            "name": "Samsung Galaxy A53 5G Unlocked Android Smartphone, 128gb. Black",
            "Description": "Time to get to work. Powered with a 5nm Octa-core processor, your Galaxy is built to handle heavy-duty multitasking. RAM Plus reads your usage patterns and provides extra virtual RAM for an additional boost. It's a whole lot. With 128GB of internal storage plus support for a microSD card up to 1TB, you've got room for all your precious moments. The Galaxy A53 5G is designed to stand out. With the Ambient Edge blending the camera with the body seamlessly, your Galaxy is entirely beautiful and fully functional with added battery capacity inside a slim, matte frame. Feast your eyes on vibrant details with the FHD+ Super AMOLED display. With the expansive 6.5-inch Infinity-O Display, enjoy vivid outdoor visibility up to 800 nits¹ while reducing blue light with the Eye Comfort Shield Watch anything on your Galaxy's 120Hz Super AMOLED display to see how silky smooth is now a viewing experience with less blur, more details, and vivid contrast. The multi-lens camera on the Galaxy A53 5G takes photos to the next level. Get crisp, clear shots with the 64MP OIS Camera, expand your viewing angle with the Ultra Wide Camera, customize focus with the Depth Camera and get closer to details with the Macro Camera. Capture your funniest moments with new Snapchat Lenses updated regularly on Fun mode. Browse and try on your favourites, capture your best look and share them with your friends. With bokeh effects and dual lenses for a depth camera powered by AI, you can capture the fine attributes that make every face unique. Blur out the background and focus on the details that brings the life out from inside the frame. A 5,000mAh (typical)² battery for more time streaming, sharing, gaming and more. Quickly revive your Galaxy with up to 25W Super Fast Charging and enable adaptive power saving to enhance the overall battery performance.",
            "targetPrice": 449.99,
            "walmartPrice": 399.00,
            "costcoPrice": 299.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcSGkwVYLmM5RGpfWrp--LoqVZ8EmXSPKEzWDLArGfc1iXTlBx0mlEw5vB9WXXPyIvHili0desqA-GaFvlsfT-NfGb1mNJwa4y6P7c1HOiV7B2OTxlrADAP3Gw"
        },
        {
            "name": "32GB Samsung Galaxy Tab A8 10.5 inch Tiger 3GB Android 11 Tablet - Dark Grey",
            "Description": "Immerse yourself in movies, TV shows, and games with the 10.5 Samsung Galaxy Tab A8 32GB Tablet. Available in a stylish dark gray color, this tablet is delivers big picture entertainment with its 10.5 1920 x 1200 resolution touchscreen display and narrow bezel design. The screen is backed by four speakers that support Dolby Atmos to enhance your movie experience with virtual surround sound. Inside is a Unisoc T618 eight-core processor with 3GB of memory, providing the power to multitask a variety of apps and games. With its 32GB storage capacity, you'll have room to store your photos and videos as you capture every moment using the 8MP front-facing and 5MP rear cameras. You can expand your storage by installing an optional microSD card, up to 1TB capacity, into the available slot. Connect to compatible 802.11ac networks to share your content, browse social media, and play online games. Android 11 is the installed operating system.",
            "targetPrice": 149.99,
            "walmartPrice": 147.99,
            "costcoPrice": 149.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcSH0MhktbvzIqQJUAoKHWT_YtSkhQfT25iMDEemOfB-OgrJ5yBfOJ2SL0Dmn3HOcm4QkFxgCIu77f__b-YkmF0HQdj1MHfA&usqp=CAY"
        },
        {
            "name": "Apple 10.2-inch iPad Wi-Fi + Cellular 64gb",
            "Description": "The Apple 10.2-Inch 64GB iPad is powerful and easy to use. This new iPad has a beautiful 10.2-inch Retina display, a powerful A13 Bionic chip, an Ultra Wide front camera with Center Stage, and works with Apple Pencil and the Smart Keyboard. It is designed for all the things you love to do. Work, play, create, learn, stay connected, and more. Revie",
            "targetPrice": 459.99,
            "walmartPrice": 399.99,
            "costcoPrice": 399.99,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcSvv0wAtjyL2bpEWZsk2oxDGM9g_Q7ZbuqU2bOigimHDOvMO6QDgpLtGsDfyII8OdSBGYIic2gYFizwoPecPRaU1FFXT8Deq5aqB1r2wOCW"
        },
        {
            "name": "PS5 Preorder Elden Ring - PlayStation 5 | Sony ",
            "Description": "Explore a sprawling realm filled with peril and wonder in ELDEN RING for PlayStation 5. As you move from its furthest reaches right to its lowest depths, stay alert to fight opponents that lurk in unsuspecting corners in this RPG action game. Experience the ultimate gaming experience as you unravel the rich and bloody history of ELDEN RING. Reviews",
            "targetPrice": 59.00,
            "walmartPrice": 52.99,
            "costcoPrice": 52.99,
            "image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcQrO2gQ1mR3JyzwyggIhIvknAuar3DdVAJK3N1Rqpzo0vsTkqBaYgwXBkWQZwIr_R0lbI-W3-o__rS1_RIKtVlf5mIF4CN7k6RfMh19AbCdj7_Pxn2IYI9k"
        },
        {
            "name": "Brookstone 3-in-1 Robo Vacuum, Black",
            "Description": "MULTIFUNCTIONAL: Unique 3-in-1 design allows you to simultaneously sweep, vacuum, and mop for the ultimate surface clean. ADVANCED SENSORS: Enhanced sensors scan constantly to detect and avoid obstacles and furniture while effectively cleaning your home.",
            "targetPrice": 199.99,
            "walmartPrice": 69.99,
            "costcoPrice": 152.99,
            "image": "https://s.yimg.com/lo/api/res/1.2/s13b5jkWFOyh2tLdGxRMOg--/YXBwaWQ9ZWNfaG9yaXpvbnRhbDtoPTQwMDtzcz0xO3c9NDAw/https://d6.cnnx.io/image/obj/21874580910;sq=400;p=0;t=ooPwmM0WTWKbBA1VCUs_f-_oll5vnJmf4_2mLN5b0dhkSuFG0RHK7fQKvGxqRMrNWaPhnksi-klzjnmjoPOBnxyCnTwmC3ZC3tF3nj5wwcRq9QOkUCgBPe-Kww==.cf.jpg"
        },
        {
            "name": "Lenovo Legion 5 Pro 16 Gaming Laptop, QHD 165Hz, AMD Ryzen 7, NVIDIA GeForce RTX 3070",
            "Description": "Operating system: Windows 11 Home Processor: AMD Ryzen 7 5800H Display: 16” QHD IPS LCD w/ LED Backlight 100% sRGB (Anti-glare) 165Hz, HDR 400 Memory: 16GB DDR4 3200MHz Internal storage: 512GB NVMe TLC SSD Graphics: NVIDIA GeForce RTX 3070 Optical Drive: None Audio: 2 x 2W Speakers Battery life: Up to 4.2 Hours Wireless: 2 x 2 802.11AX Wi-Fi with Bluetooth 5 Webcam: 720P Camera and dual array Microphone Product weight: 5.39 lbs Color: Storm Grey",
            "targetPrice": 1429.59,
            "walmartPrice": 1298.67,
            "costcoPrice": 1099.89,
            "image": "https://s.yimg.com/lo/api/res/1.2/AsZYSg1S9uoVHXGsSByRwQ--/YXBwaWQ9ZWNfaG9yaXpvbnRhbDtoPTQwMDtzcz0xO3c9NDAw/https://i5.walmartimages.com/asr/0e3c1612-1a7f-41ec-91f9-c2b9f3cac1fd.8441ec1bab6f971d522646dbbdf32896.jpeg"
        },
        {
            "name": "Dyson V8 Origin Vacuum",
            "Description": "Powerful Dyson suction and lightweight for quick cleaning. Without the cord. Engineered for homes with pets. Removes dirt, allergens and pet hair around your home. Up to 40 minutes of run time: Battery-saving trigger helps maximize energy-efficiency, only using power when you need it. Actual run time will vary based on power mode and/or attachments used. Detangling Motorbar™ cleaner head: Deep cleans carpets and hard floors with hair removal vanes to clear long hair and pet hair from the brush bar.",
            "targetPrice": 299.99,
            "walmartPrice": 499.99,
            "costcoPrice": 350.89,
            "image": "https://target.scene7.com/is/image/Target/GUEST_d209f5d0-0185-4799-9cee-8ed80f27a8d7?wid=2220&hei=2220&fmt=pjpeg"
        },
        {
            "name": "Sony PlayStation 5 - Standard",
            "Description": "Integrated I/O: Marvel at incredible graphics and experience new PS5 features.Ultra-high speed SSD: Maximize your play sessions with near-instant load times for installed PS5 games. HDR technology: With an HDR TV, supported PS5 games display an unbelievably vibrant and lifelike range of colors. 8K output: PS5 consoles support an 8K output, so you can play games on your 4320p resolution display. 4K TV gaming: Play your favorite PS5 games on your stunning 4K TV. Up to 120 fps with 120Hz output",
            "targetPrice": 499.99,
            "walmartPrice": 489.99,
            "costcoPrice": 489.99,
            "image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcSbKnqqdMH6hYKh8mzk9kje2m3KI-bRktHWihZ_LYAHQF0BNIXyfzjjusW0XMVpuUk13pFiHLVztP7Rk7GDgxBUnC6hFY84sQ&usqp=CAY"
        },
        {
            "name": "Elden Ring Collectors Edition",
            "Description": "This is an action RPG title set in the world of authentic dark fantasy. You can enjoy an unknown discovery through a vast field and dungeon search. The difficulty to overcome and the sense of accomplishment when you overcome it. Then you can enjoy a group play where the characters' expectations are mixed. A vast world in which an open field with a variety of situations and a huge dungeon built in a complex and three dimensional form are seamlessly connected. Beyond the search, the player will be greeted with the joy of an unknown discovery and the overwhelming threat of a high sense of accomplishment. Limited Edition Privilege Blade of Michela, Malenia Stout Art Book (40P) Digital Original Soundtrack Steel Book",
            "targetPrice": 429.99,
            "walmartPrice": 249.99,
            "costcoPrice": 349.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcSqC1rApBdBBpLLJemwKBuTZAFGdWgFnaabm_fQNzA1K2z1rTlCo7IXJLQI4JrYPOoLN61d7mEF0eXNR0RDRbhTwUwICax1iUiZqsTfnqs0"
        },
        {
            "name": "Xbox Console Microsoft - Series x 1TB",
            "Description": "Experience next-gen speed and performance with the Xbox velocity architecture, powered by a custom SSD and integrated software. Play thousands of games from 4 generations of Xbox with Backward compatibility, including optimized titles at launch. Backward Compatible · Blu-ray Compatible · 4K Capable · Xbox Live / Live Gold · With Motion Control · With Expandable Storage Introducing Xbox Series X RRT-00001. Play thousands of titles from four generations of consoles—all games look and play best on Xbox Series X. At the heart of Series X is the Xbox Velocity Architecture, which pairs a custom SSD with integrated software for faster, streamlined gameplay with significantly reduced load times. Seamlessly move between multiple games in a flash with Quick Resume. Explore rich new worlds and enjoy the action like never before with the unmatched 12 teraflops of raw graphic processing power. Enjoy 4K gaming at up to 120 frames per second, advanced 3D spatial sound, and more.",
            "targetPrice": 449.00,
            "walmartPrice": 449.00,
            "costcoPrice": 449.00,
            "image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcTfEGBtDFblyqT_33OVQgxqfbdXGr89UamMtadhSfldN_1BqQNJutZlD1-Isfe0fLo68TNGFJZejI9vlDGV-FiwpbGy5RfLqxhrFH_lHGoJ"
        },
        {
            "name": "Nintendo Switch OLED ",
            "Description": "Enjoy vivid colors and crisp contrast with a screen that makes colors pop Wide adjustable stand Freely angle the system's wide, adjustable stand for comfortable viewing in Tabletop mode Wired LAN port Use the dock's LAN port when playing in TV mode for a wired internet connection 64 GB internal storage Save games to your system with 64 GB of internal storage Enhanced audio The new system features a vibrant 7-inch OLED screen, a wide adjustable stand, a dock with a wired LAN port, 64 GB of internal storage, and enhanced audio. Feast your eyes on vivid colors and crisp contrast when you play on the go.See the difference the vibrant screen makes, whether you're racing at top speed or squaring off against enemies. Flip out the sturdy stand for easy viewing in Tabletop mode. Adjust the stand to find the optimal viewing angle—perfect for a quick multiplayer game with a buddy.",
            "targetPrice": 349.00,
            "walmartPrice": 275.98,
            "costcoPrice": 349.00,
            "image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcRESVpa59n7bVZZMtPQSF28sHL_BpPRHoiRcrf1ydEF1lX9U82ryZQEeBsb1yex3rXWwlN-lwYE3N6M0hYqI7XNHugEEXbX1jYWGGfizhFTUsjUkvL2YFmLT4A"
        },
        {
            "name": "Hogwarts Legacy - Nintendo Switch",
            "Description": "Hogwarts Legacy is an immersive, open-world action RPG set in the world first introduced in the Harry Potter books. Embark on a journey through familiar and new locations as you explore and discover magical beasts, customize your character and craft Potions, master spell casting, upgrade talents and become the wizard you want to be. Experience Hogwarts in the 1800s. Your character is a student who holds the key to an ancient secret that threatens to tear the wizarding world apart. Discover the feeling of living at Hogwarts as you make allies, battle Dark wizards, and ultimately decide the fate of the wizarding world. Your legacy is what you make of it. Live the Unwritten.",
            "targetPrice": 59.99,
            "walmartPrice": 59.99,
            "costcoPrice": 59.99,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcQ44f7j1r8G05B0nz70siqdB93Lwb242P7r0dEvNG5NYDB5j92Nqqg-WfwKXt9Nkm0HlOwcKqJvRc6ctkDS_cQM28dKCiU_55d128HdP7E&usqp=CAE"
        },
        {
            "name": "Beats Studio 3 Over-Ear Noise Canceling Bluetooth Wireless Headphones",
            "Description": "",
            "targetPrice": 169.99,
            "walmartPrice": 258.99,
            "costcoPrice": 349.99,
            "image": ""
        }
    ],
    "HomeGoods": [
        {
            "name": "Aquasonic Black Series Ultra Whitening Toothbrush",
            "Description": "40,000 VPM Smart Toothbrush - Beauty, brains and power. The Black Series is a world class modern electric toothbrush packed with the most up to date technology. It features an ultra-powerful and industry leading motor producing 40,000 vibrations per minute , lithium-ion battery, ultra-fast wireless charging, 4 mode operation, smart vibration timers, 8 DuPont engineered brush heads and bristles, and a custom travel case; all with a sleek ultra-slim, lightweight and IPX7 rated waterproof design. ",
            "targetPrice": 59.94,
            "walmartPrice": 38.47,
            "costcoPrice": 24.95,
            "image": "https://target.scene7.com/is/image/Target/GUEST_4d475e37-5440-481c-a943-b31a84a8cdb6?wid=2220&hei=2220&fmt=pjpeg"
        },
        {
            "name": "Dyson V8 Origin Vacuum",
            "Description": "Powerful Dyson suction and lightweight for quick cleaning. Without the cord. Engineered for homes with pets. Removes dirt, allergens and pet hair around your home. Up to 40 minutes of run time: Battery-saving trigger helps maximize energy-efficiency, only using power when you need it. Actual run time will vary based on power mode and/or attachments used. De-tangling Motorbar™ cleaner head: Deep cleans carpets and hard floors with hair removal vanes to clear long hair and pet hair from the brush bar.",
            "targetPrice": 299.99,
            "walmartPrice": 499.99,
            "costcoPrice": 350.89,
            "image": "https://target.scene7.com/is/image/Target/GUEST_d209f5d0-0185-4799-9cee-8ed80f27a8d7?wid=2220&hei=2220&fmt=pjpeg"
        },
        {
            "name": "Hamilton Beach 2 Slice Toaster - Stainless Steel",
            "Description": "Hamilton Beach Brushed Stainless Steel Toaster with the added convenience of easy removal. This attractive toaster has a toast boost feature that gives breads a high lift for removal, so you can easily grab even the smallest of slices. Extra wide slots make it ideal for bagels, English muffins or slices of artisan bread. A shade selector lets you achieve your preferred toast doneness. And the automatic shutoff will turn it off at the end of the cycle, even if food gets jammed. Made with a brushed stainless steel finish, this toaster will be a stylish addition to your countertop, but is also easy to store thanks to a fuss-free cord wrap.",
            "targetPrice": 24.99,
            "walmartPrice": 15.99,
            "costcoPrice": 21.98,
            "image": "https://target.scene7.com/is/image/Target/GUEST_64831f9a-da3f-48d5-9ed6-4b417813ab49?wid=2220&hei=2220&fmt=pjpeg"
        },
        {
            "name": "KitchenAid Ultra Power Plus 4.5qt Tilt-Head Stand Mixer",
            "Description": "Whether you need 8 dozen* of your signature chocolate chip cookies or shredded chicken for Taco Tuesday with friends and family, the KitchenAid® Deluxe 4.5 Quart Tilt-Head Stand Mixer has the capacity for every occasion. This durable tilt-head stand mixer was built to last, and features 10 speeds to gently knead, thoroughly mix and whip ingredients for a wide variety of recipes and comes in a variety of colors to perfectly match your kitchen design or personality. Get creative and make more with your mixer with over 10 optional hub-powered attachments**, from food grinders to pasta makers and more.",
            "targetPrice": 399.99,
            "walmartPrice": 275.98,
            "costcoPrice": 350.27,
            "image": "https://target.scene7.com/is/image/Target/GUEST_a8002c5e-b97a-4958-a0f6-5ce0a9ff3c5e?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Instant Pot 6qt Duo Pressure Cooker",
            "Description": "Easy to use, easy to clean, fast, versatile, and convenient, the Instant Pot Duo™ is the one that started it all. The updated Easy-Release switch makes steam release simple and fast. And this stunning stainless steel finish will be a beautiful addition to your kitchen. Redefine cooking and enjoy quick and easy meals anywhere, any time.",
            "targetPrice": 99.99,
            "walmartPrice": 97.99,
            "costcoPrice": 89.99,
            "image": "https://target.scene7.com/is/image/Target/GUEST_7b4d75d0-58d4-44c2-a010-c640341423b0?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Tribest Personal Blender Original Single-Serving Blender",
            "Description": "",
            "targetPrice": 75.89,
            "walmartPrice": 80.99,
            "costcoPrice": 59.99,
            "image": "https://target.scene7.com/is/image/Target/GUEST_3a81f550-fc22-4eb3-9c67-9d07ac0ac6ed?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Keurig K-Mini Single-Serve K-Cup Pod Coffee Maker",
            "Description": "The Keurig K-Mini single serve coffee maker features a sleek design with matte finish, and at less than 5 inches wide is the perfect size for any space or occasion. The K-Mini brewer is effortlessly simple to use - just add fresh water to the reservoir, pop in your favorite K-Cup pod, press the brew button and enjoy fresh brewed, delicious coffee in minutes. Choose from hundreds of delicious K-Cup pod varieties to enjoy 6-12oz of your favorite coffee, tea, cocoa, and iced beverages. With a single cup reservoir and cord storage, the K-Mini coffee maker is the portable brewer that makes anywhere perfect for great coffee. The K-Mini coffee maker is available in a variety of matte-finish colors. Based on consumer feedback, we have updated the K-Mini Brewer. Customer reviews have been removed that relate to the previous version of the brewer.",
            "targetPrice": 75.99,
            "walmartPrice": 99.99,
            "costcoPrice": 69.99,
            "image": "https://target.scene7.com/is/image/Target/GUEST_b8deec10-1817-45ab-aee8-15d1143d7ea9?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Artificial Eucalyptus Arrangement",
            "Description": "This Artificial Eucalyptus Arrangement from Threshold™ makes for an appealing addition to almost any space in your home. This artificial potted plant makes a great addition to your year-round decor. It features natural-looking faux eucalyptus leaves arranged together to offer a lively vibe to your home decor, and comes potted inside a white container for quick and easy display on any flat surface. Just place it on the mantel, console or sideboard along with other potted plants to create an indoor oasis.",
            "targetPrice": 3.59,
            "walmartPrice": 8.59,
            "costcoPrice": 6.59,
            "image": "https://target.scene7.com/is/image/Target/GUEST_cf6a8c1d-a2cb-4a8a-aef6-ca3f3b9118fc?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Artificial Leaf Arrangement",
            "Description": "Bring the beauty of the great outdoors into your home with this Artificial Leaf Arrangement from Threshold™. This artificial potted plant showcases lush green leaves arranged together to lend extra texture for a warm and welcoming look. The pretty artificial leaf arrangement is housed inside a white ceramic pot for quick and easy display. Whether you place this artificial potted plant on a console table in your entryway or on a shelf in your kitchen, this artificial potted plant is the perfect pick for your space.",
            "targetPrice": 4.59,
            "walmartPrice": 8.75,
            "costcoPrice": 6.00,
            "image": "https://target.scene7.com/is/image/Target/GUEST_f5aca15a-fcfb-47cc-bab0-66df5546cd64?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Solid Luxury Premium Cotton 6 Piece Bathroom Towel Set",
            "Description": "Update your shower space with the Solid Luxury Premium Cotton 6 Piece Towel Set by Blue Nile Mills. This exquisite bundle is crafted with premium Cotton pile and includes 2 bath towels, 2 hand towels and 2 face towels. This set comes in an array of lively, solid colors that make a wonderful accent adorning your master or guest bath.",
            "targetPrice": 92.49,
            "walmartPrice": 89.69,
            "costcoPrice": 82.99,
            "image": "https://target.scene7.com/is/image/Target/GUEST_2cd05b4f-c949-4122-88c4-386fe9e22fd6?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Computer Desk",
            "Description": "",
            "targetPrice": 114.98,
            "walmartPrice": 192.00,
            "costcoPrice": 156.39,
            "image": "https://target.scene7.com/is/image/Target/GUEST_e2d3c891-8464-464c-8fc1-e5e6e34ff8f5?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Adaline Platform Bed",
            "Description": "Upgrade your bedroom decor with this Adaline Platform Bed from Threshold™. This platform bed features a comfortable low profile and a sleek rounded headboard for a simple, stylish look. The solid-colored upholstery finish complements any existing decor, while the pine wood frame offers a lovely, natural base. Coordinate it with a mattress and your choice of bedding to create a comfortable and eye-catching sleeping space.",
            "targetPrice": 1100.00,
            "walmartPrice": 1402.69,
            "costcoPrice": 998.65,
            "image": "https://target.scene7.com/is/image/Target/GUEST_84c01865-ba7d-49a1-8068-f9d2dc1ab20c?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Ameriwood Home Chicago Electric Fireplace TV Console",
            "Description": "Turn up the ambiance with the Ameriwood Home Chicago Electric Fireplace TV Console. Made of laminated MDF and particleboard, the light brown woodgrain finish is sure to complement your living room, family room or sitting rooms decor with its traditional style and molding details. This electric fireplace allows you to enjoy the flame with or without heat, and features a LED light source boasting up to 50,000 hours of life. The 18 fireplace warms rooms up to 400 square feet and also offers open storage for your cable box, gaming console or Blu-Ray player. The TV Stand holds a flat screen TV up to 50” with a maximum weight of 70 lbs. so you can relax in the comfort of your own home while watching your favorite TV shows or movies. It also features easy-access storage behind 2 glass doors to keep your Blu-Rays, books and remotes from the everyday dust. The Stand ships flat to your door and 2 adults are recommended to assemble.",
            "targetPrice": 399.99,
            "walmartPrice": 289.87,
            "costcoPrice": 246.37,
            "image": "https://i5.walmartimages.com/asr/068afd40-2fcc-4b7e-ab23-900a3a21d52b.6904b35c7197e980c39933adf84af0e8.jpeg?odnHeight=160&odnWidth=160&odnBg=FFFFFF"
        },
        {
            "name": "Sunbeam Grey Faux Fur Heated Throw",
            "Description": "Snuggle up with the Sunbeam Faux Fur Heated Throw to beat those winter chills and warm you up on cold nights. Indulge yourself with its ultra silky faux fur fabric to keep you toasty and comfortable while you unwind. The stylish color adds a beautiful accent to any decor. This 50 x 60 electric throw makes a great accessory while relaxing on the couch, bed or your favorite chair.It includes an easy-to-use push button controller with 3 personalized heat settings, allowing you to get just the right temperature, and a 3-hour auto-shut off feature for added peace of mind. The heated wires are made with premium components and includes a wire technology that senses and adjusts for continuous heat and safe operation.When ready to clean, simply detach the controller from the throw and place into the washing machine and tumble dry for easy care, stays silky soft after many washes. You can rest easy knowing it was built to last and includes a limited 5-year warranty.",
            "targetPrice": 49.89,
            "walmartPrice": 35.89,
            "costcoPrice": 37.47,
            "image": "https://i5.walmartimages.com/asr/71db63c7-b3f7-4b77-9f33-527f994b260a.c21525e8e8a540b53996f74212c30b5d.jpeg?odnHeight=160&odnWidth=160&odnBg=FFFFFF"
        },
        {
            "name": "Jianna Faux Leather Sofa, Black",
            "Description": "If you have a family of little ones or a family of furry one - you need a couch that can sturdily and stylishly hold up to your daily life. With this easy-to-maintain Jianna Faux Leather Sofa, clean and comfortable is the name of the game. Covered in a durably plush black faux leather with warm tapered wood legs and under frame, this 3-seater sofa with square arms has an adaptable mid-century modern-meets-industrial sensibility with ultra-modern construction to last for years to come. Plus, since it's perfectly sized and easy to assemble and disassemble, moving it from room to room or house to house is a breeze. Assembly required",
            "targetPrice": 320.00,
            "walmartPrice": 242.36,
            "costcoPrice": 224.56,
            "image": "https://i5.walmartimages.com/asr/18140a5d-9807-4586-8d55-672564fbe9db.65849c1e8030cd9a95a7cbecdc5eef04.jpeg?odnHeight=160&odnWidth=160&odnBg=FFFFFF"
        }
    ],
    "Toys": [
        {
            "name": "Barbie - Dreamhouse Playset",
            "Description": "Open the door to the new Barbie Dreamhouse for unlimited storytelling possibilities! Standing 109cm tall and 104cm wide, this dreamy dollhouse inspires 360-degree play with three floors and 10 indoor and outdoor living areas. There's so much to explore.Create Your Dream Dollhouse Move right in and customize the space  the grass area and pool can be placed in multiple configurations on the first and third floors. Plus, the slide in your Barbie Dreamhouse fits in four second-floor locations. Play out any story, from an ordinary day to the ultimate get-together with a kitchen, living room, dining room, bedroom, bathroom, pool, balcony, party room and moreInteractive Dolls House Let your Barbie Dreamhouse set the scene for any story with three songs, two soundscapes and customisable light settings! The transforming furniture doubles the fun, too. The BBQ grill reverses to reveal a dessert buffet, the entertainment center reverses to reveal a pet play area, and a bunk bed folds down from the wall. Lift and lower Barbie doll and her friends in the working elevator. Dolls, vehicle and wheelchair not included.",
            "targetPrice": 199.99,
            "walmartPrice": 149.99,
            "costcoPrice": 175.69,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcTvAL0V280Vf5RnYOXbKzNlv8LTGZHI5zCiNG-sHIC5NTLVab7a&usqp=CAY"
        },
        {
            "name": "Magic Mixies Blue Interactive Plush Toy Magical Misting Cauldron",
            "Description": "Experience real magic - just mix your potion and make your pet! Who will you magically create? Includes all magic ingredients you need and a special Wand to mix a potion and make a cute furry friendbe amazed as your Magic Mixie appears through the mist! Follow the spell by adding the magical ingredients to your Cauldron one step at a time, waiting for the green light and tapping 3 timeswhen the potion is finished watch as REAL MIST begins to rise from the Cauldron. So adorable and so interactive, your Magic Mixie reacts to your touch and responds to your wand - they love to perform spells with you and may even grant you a wish! Comes with 50+ sounds and reactions from the Cauldron and your Magic Mixie! You can make real Magic happen again and again! Your Magic Mixie can be reloaded back into the Cauldron so you can repeat the spell and mist for your friends! Or, reveal your own toys using the included Gem Case. You can even make your own unique potions and spells using the second Spell Mode of play. The Magic Mixies Magic Cauldron Refill Pack (sold separately) is also available and contains enough ingredients to create 2 new spells and 20+ misting moments, so you can repeat the magical reveal again and again.",
            "targetPrice": 74.99,
            "walmartPrice": 69.28,
            "costcoPrice": 56.04,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcTpEhYVirIJRFjy77Fj4XQPoib-QJHr-4CV2wpNSAHQ19WLpkZ1tKgQKFJyiG9cTstvReeMPpCRkSmbHyTBwXJ0aCkAtX4T7NF-dloKnJTfTfeuqrv3bB2l"
        },
        {
            "name": "DJI Air 2S Fly More Combo Drone",
            "Description": "The compact and foldable design of the DJI Air 2S Fly More Combo Drone lets you easily capture breathtaking aerial images and video whenever the mood strikes. It's an ideal alternative for use when travelling on vacation or for photography enthusiasts looking to record from new and unique perspectives. Piloting is made to be easy and intuitive via your smartphone and the DJI Fly app. Simply slip your phone into the included remote controller. Thanks to the Air 2S 3-axis gimbal, four remote antennae, and OcuSync 3.0 technology, you can receive a stable, live view from the drone up to 7.5 miles away.Less",
            "targetPrice": 1229.00,
            "walmartPrice": 1199.00,
            "costcoPrice": 1215.00,
            "image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcTWkCww5uvvSHxQ14k_9jzHzkQSrx1fx7zracRlvOiNJrHPYLik1SHcjNL_micYxK06DXFpLedq9aZrPGBtl79ttRGiisiO1w&usqp=CAY"
        },
        {
            "name": "Nintendo Switch Lite",
            "Description": "Nintendo Switch Lite is a compact, lightweight Nintendo Switch system dedicated to handheld play. With a built-in +Control Pad and a sleek, unibody design, it's great for on-the-go gaming. Nintendo Switch Lite is compatible with the robust library of Nintendo Switch games that support handheld mode. If you're looking for a gaming system all your own, Nintendo Switch Lite is ready to hit the road whenever you are.",
            "targetPrice": 250.00,
            "walmartPrice": 215.63,
            "costcoPrice": 225.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcQAGfv-Anc8MGzOZVbOii9cltop07YdSJTTCZIgiOEo2D1F_TFCvttrwrKgBk5L8zZZ3lXQ0wfK1js3xnG5GqWonzHxubPnxg&usqp=CAY"
        },
        {
            "name": "Jurassic World: Dominion Epic Battle Pack Figure Set",
            "Description": "Get ready for thrilling action and adventure with Jurassic World Dominion! With 4 action figures - Dr. Ellie Sattler plus 3 dinosaurs with attack features, this pack is ready for recreating an epic battle scene from the movie and further creative storytelling. Three fierce dinos -- the Strike n' Roar Giganotosaurus, Thrash 'N Devour T. rex and Sound Slashin' Therizinosaurus are ready to rumble in the Biosyn Valley. All the figures feature movable joints, authentic design with realistic sculpting, colors and textures. Bring these dinosaurs TO LIFE with extended digital play using Augmented Reality (AR)! Dare to see how REAL dinosaur play can get! Just scan the hidden DNA code with any smart device to unlock the AR experiences in the free Jurassic World Facts app (Android & iOS). Smart device not included. Makes a great gift for kids ages 4 years and older who love dinosaur action play. Colors and decorations may vary.",
            "targetPrice": 128.99,
            "walmartPrice": 98.99,
            "costcoPrice": 64.99,
            "image": "https://target.scene7.com/is/image/Target/GUEST_7d0f82e9-a482-417c-b808-3970b785443e?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Jetson Mojo Light Up Hoverboard with Bluetooth Speaker",
            "Description": "",
            "targetPrice": 159.99,
            "walmartPrice": 114.99,
            "costcoPrice": 124.98,
            "image": "https://target.scene7.com/is/image/Target/GUEST_8e21bc85-fe95-47d6-b597-ec70dd580e34?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Wavelength Game",
            "Description": "Wavelength is a party game where two teams compete to read each other's minds. It's a thrilling experience of TALKING and THINKING and HIGH FIVING that anyone can play—but it also has some of that deep word game sorcery, where your decisions feel tense, strategic, meaningful. Each round, one player has to guide their teammates to guess where a hidden target is located. But they can only give a clue on the spectrum between two concepts, like “Hot - Cold” or “Fantasy - Sci-Fi.” And the closer to the target's center, the more their team scores!",
            "targetPrice": 34.99,
            "walmartPrice": 28.99,
            "costcoPrice": 26.53,
            "image": "https://target.scene7.com/is/image/Target/GUEST_ecb33326-b841-44d0-89c0-c79fd07d9cc8?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "The Chameleon Board Game",
            "Description": "Blend in. Don't get caught. Six players. One word each. Everyone sounded pretty convincing, but someone isn't who they say they are. That someone is The Chameleon. In each round of The Chameleon, a secret word is selected from a Topic Card in the middle of the table. Everyone knows what the word is, except for the player with the Chameleon card… but which player is it? Using cunning, social deduction and some serious mob mentality, each player shouts out a related word to prove their innocence and tries to track down the impostor. Once everyone's said their piece, the voting begins and the moment of truth arrives. In order to successfully track down the guilty player and win the game, players will have to use all of their teamwork and witch-hunting skills. If you're the Chameleon, however, the rules are much more simple. Don't. Get. Caught.",
            "targetPrice": 19.97,
            "walmartPrice": 19.97,
            "costcoPrice": 15.86,
            "image": "https://target.scene7.com/is/image/Target/GUEST_f2e9abc6-bd3c-40f4-ab94-fcacdd64193f?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Cards Against Humanity",
            "Description": "Cards Against Humanity is a party game for horrible people. The game is simple. Each round, one player asks a question from a black card, and everyone else answers with their funniest white card. This is the main game. You should buy this first, and then mix in your favorite expansion packs. ",
            "targetPrice": 29.00,
            "walmartPrice": 31.22,
            "costcoPrice": 28.99,
            "image": "https://target.scene7.com/is/image/Target/GUEST_e48a7fee-314a-495f-bbf0-4ff2fac5e07a?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Nintendo 11 inch  Plush - Yoshi",
            "Description": "Introducing the new, improved and larger Yoshi plush to add to your collection! Yoshi is Mario's lovable dinosaur companion in the Super Mario Bros series. Usually found in his icon green hue, Yoshi can be found in various colors. Yoshi eats his way through the competition with his long tongue and nothing is too difficult for his stomach to digest! ",
            "targetPrice": 27.99,
            "walmartPrice": 18.99,
            "costcoPrice": 26.99,
            "image": "https://target.scene7.com/is/image/Target/GUEST_ecccc624-f939-440e-9266-ebdd472990f8?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "LEGO Avatar Toruk Makto & Tree of Souls",
            "Description": "This LEGO Avatar Toruk Makto & Tree of Souls (75574) building toy set is great for kids ages 12+ who love science fiction. The set includes Jake Sully, Neytiri, Mo'at and Tsu'Tey Na'vi minifigures, a posable Toruk figure with foil wings, Direhorse figure and a buildable Tree of Souls, plus 3 environment builds with glow-in-the-dark elements. Expand a child's passion for the movie with a toy set featuring an iconic location that lets kids replay known scenes or create new ideas independently or as part of a great family moment. Mix and collect sets (sold separately) to build endless versions of Pandora. With well-known characters and unique creatures and locations, LEGO Avatar sets offer varied story and play options. The models also look great on display, with a detailed environment build made for posing the creatures. Older kids and fans can enjoy a joyful focus as they rediscover the vibrant universe.",
            "targetPrice": 149.99,
            "walmartPrice": 139.99,
            "costcoPrice": 140.00,
            "image": "https://target.scene7.com/is/image/Target/GUEST_cdb06e6d-238a-4bbf-88f3-29f5aa1dd31f?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Character Weighted Plush Throw Pillow",
            "Description": "From cuddling to playing, this Animal Weighted Plush Throw Pillow from Pillowfort™ will make the perfect companion for your darling. This animal plush pillow feels oh-so soft to cuddle. Whether you're using it as a decorative pillow in your kid's room or a cuddling companion for them, you'll love the cute flair it offers.",
            "targetPrice": 20.00,
            "walmartPrice": 19.99,
            "costcoPrice": 25.98,
            "image": "https://target.scene7.com/is/image/Target/GUEST_d5fd013f-3e52-4cf7-bbbf-b5d75e6cc08f?wid=325&hei=325&qlt=80&fmt=pjpeg"
        },
        {
            "name": "Marvel Legends, Moon Knight",
            "Description": "Hasbro Marvel Legends Mr. Knight Clad in the ceremonial armor of Khonshu's chosen warriors throughout the centuries, Marc Spector is Moon Knight, sworn to obey Khonshu and deliver his vengeance accordingly. With over 80 years of entertainment history, Marvel has become a cornerstone of fan collections around the world. With the Marvel Legends Series, fan favorite Marvel characters are designed with premium detail and articulation for posing and display in collections. From figures to vehicles to premium roleplay items, the Marvel Legends Series offers elite character-inspired products for Marvel fans and collectors.",
            "targetPrice": 22.99,
            "walmartPrice": 22.99,
            "costcoPrice": 25.99,
            "image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcS-VR44WoMiBPgfaiO8C9fdVOClmPi4ifNYpuqMeIPO84T_w5cW5eVTKch-HuatSVKyishXlRsMhZx8pWo5OvafLaygLsw2zhs7JQpuXPny9qErHhB2Bunutg"
        },
        {
            "name": "Barbie Signature 2022 Holiday Doll with Brunette Hair, Collectible Series",
            "Description": "It's the time of year for giving, gathering, and creating heartwarming memories that will last a lifetime. 2022 Holiday Barbie Doll embodies the spirit of the season in a vibrant, red gown inspired by the beautiful poinsettia, a symbol of good will and community spirit. Her ensemble dazzles with a shimmering poinsettia detail at the neckline and a layer of tulle and satiny petals adorning her long, full skirt. Gorgeous, golden chandelier earrings and red lips complete her look. In packaging that's ideal for display, this collectible 2022 Holiday Barbie doll makes a great gift for 6 year olds and up. Includes doll stand and Certificate of Authenticity. Doll cannot stand alone. Colors and decorations may vary.",
            "targetPrice": 39.94,
            "walmartPrice": 19.97,
            "costcoPrice": 45.99,
            "image": "https://i5.walmartimages.com/asr/c3083753-79ac-4cbe-8d00-11697a9f8d5c.2ae530bd208fae8f0c3044926694f51c.jpeg"
        },
        {
            "name": "Funko POP! Marvel Black Panther: Wakanda Forever King Namor",
            "Description": "New adventures and faces await as you return to the Kingdom of Wakanda. Pop! King Namor is ready to take on the action as part of your Marvel collection. Collect this hero to complete your set from Marvel Studios' Black Panther: Wakanda Forever. Vinyl bobblehead is approximately 5.7-inches tall.",
            "targetPrice": 23.99,
            "walmartPrice": 25.99,
            "costcoPrice": 22.99,
            "image": "https://media.gamestop.com/i/gamestop/20001828/Funko-POP-Marvel-Black-Panther-Wakanda-Forever-King-Namor-5.7-in-Vinyl-Bobblehead?fmt=auto&$pdp-gallery$"
        },
        {
            "name": "Mini Plague Doctor Plush Toy",
            "Description": "Did somebody call for a doctor? Bring home a new cute and cuddly pal by getting yourself this Squishable Mini Plague Doctor Plush Toy. This adorable plush toy is sure to be a favorite in your collection once you feel how soft and snuggable he is.",
            "targetPrice": 24.99,
            "walmartPrice": 22.97,
            "costcoPrice": 24.99,
            "image": "https://spencers.scene7.com/is/image/Spencers/03835881-a?$Alternate$"
        },
        {
            "name": " Light-Up Sitting Sam Doll - Trick 'r Treat",
            "Description": "Add the perfect element of horror to your home with this official Trick 'r Treat Light-Up Sitting Sam Doll! This scary doll features a light-up pumpkin that plays creepy laughter and music to heighten the spooky vibes! This doll is the perfect prop for any horror movie fan who wants to pay tribute to Sam at Halloween or any time.",
            "targetPrice": 99.99,
            "walmartPrice": 92.89,
            "costcoPrice": 96.89,
            "image": "https://spencers.scene7.com/is/image/Spencers/01547397-a?$Alternate$"
        },
        {
            "name": "Tarmeek Toy  Plush Pillows",
            "Description": "Each plush toy is made of high-quality, high-density plush materials suitable for children, maximizing flexibility, weight and quality, allowing you to feel it at the first touch. Soft and cute stuffed animals, suitable for girls, boys, children and children's day, Christmas, birthday, Valentine's Day, Halloween. Lovely home decoration, suitable for bedroom, living room, home, office and other decorations. The size of this hug pillow is right, giving you a perfect hug. When you are not at home or your child is sad, your child can share something with it to make him feel relaxed and happy",
            "targetPrice": 15.99,
            "walmartPrice": 7.99,
            "costcoPrice": 19.99,
            "image": "https://i5.walmartimages.com/asr/3c95fdf1-75e1-41d6-8b04-5b027e6edbb4.a83711f79a312ddf81ce116e8b7d1d66.jpeg?odnHeight=160&odnWidth=160&odnBg=FFFFFF"
        },
        {
            "name": "Doorables Multi Peek Collectible Figure Series 8 Blind Box ",
            "Description": "Behind every door a surprise is in store with Disney Doorables Mini Peek Series 8 Collectible Figures. Unbox 5, 6, or 7 Disney figurines. Then, open the doors! Series 8 includes 58 characters from the stories of Disney's Hercules, Alice in Wonderland, Wreck-It Ralph, Glittery Disney Fairies, Toddler Disney Princesses, Disney Pixar's Turning Red, and 6 pearlized translucent figures from Monsters, Inc. There are even 6 special edition scented figures, and two limited edition figures with unique collector coins. Each character stands approximately 1.5 inches tall and features stylized detailing with sparkly glitter eyes. Recreate classic Disney tales or invent new adventures. The stories are endlessly fun - and get better as additional kids toy figures & playsets are collected, displayed, and shared. A fun toy for kids ages 5 years and up.",
            "targetPrice": 9.34,
            "walmartPrice": 7.26,
            "costcoPrice": 8.99,
            "image": "https://products.blains.com/600/142/1429784.webp"
        },
        {
            "name": "Toniebox Starter Set Creative Starter Box Red",
            "Description": "Toniebox starter set by Tonies for children aged 3 years and over now online at German Toys. The introduction to the new listening and playing experience. The Toniebox is a shock-proof, robust ear cube that is operated by hearing figures, also known as tonies. The starter set includes a tonie box, an exclusive creative tone, in anthracite as well as a charging station for the tonie box.",
            "targetPrice": 110.39,
            "walmartPrice": 129.99,
            "costcoPrice": 128.99,
            "image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcSv4j8ob7_wryho614k403jXkk2PQkpf2C6yKR7QuRwHo9YWWQMMpcazYB-sWkDHPezYputjg40E4HlNMDfkrFh-j7mgMI7uwB0vpH0Iza4TmUkShh0l5tl"
        },
        {
            "name": "Bayonetta 3 Trinity Masquerade Edition",
            "Description": "Show that you're the baddest witch around with the Bayonetta 3 Trinity Masquerade Edition. Get up close and personal with the beauties and beasts of Bayonetta 3 with a 200-page art book, and proudly display the whole trilogy with three game cases, one for each title, that combine to form panoramic artwork. The trio of covers are reversible, too. Of course, the Bayonetta 3 game and all its chaos is included. The witch is back and more powerful than ever! Bayonetta struts through multiple locations in an all-new, over-the-top climax action game. Sporting a wicked new ensemble and somehow familiar pigtails, the titular Umbra Witch must face a mysterious evil using her signature guns and time-slowing Witch Time ability. This time, invading manmade bioweapons called Homunculi find themselves in Bayonetta's crosshairs. Get ready for a devilishly good time Tap into Bayonetta's naughtier side with Demon Masquerade, a new ability that channels the demon linked to her weapon allowing for some exciting action options, not to mention some hair-raising combos. She can also summon her demonic darlings like Gomorrah, Malphas, and Phantasmaraneae during battle, unleashing their demonic powers in the heat of combat and in new, larger-than-life battles where you directly control the action. A bounty of Bayonettas Fight your way through the streets of Tokyo, the mountains of China, and many other locales! Along the way you'll meet a virtual coven of Bayonettas, each more fabulous than the last. You'll also slash and slay as Viola, a feisty witch in training who fights with a sword and a capricious companion, the demon Cheshire. Find out what fate awaits Bayonetta, and if this arcane alliance can really save reality! Nintendo SEGA Published by Nintendo. Nintendo Switch is a trademark of Nintendo. Nintendo.",
            "targetPrice": 119.99,
            "walmartPrice": 102.99,
            "costcoPrice": 89.98,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcR11POMfocjfVEt7rOp2OKWq2P3S5bZtrSj7XDblfKg4fMx6e12a3j5zukcFRRhlinF53F9Kj3xw4kW6IbzaWs1NjBVwwvD2lkqSuZ0CFSI"
        },
        {
            "name": "Gotham Knights Collector's Edition PlayStation 5",
            "Description": "Play as a New Guard of DC Super Heroes - Step into the roles of Batgirl, Nightwing, Red Hood and Robin and shape Gotham's newest protector to create your own version of the Dark Knight. Action-Packed, Original Story Set in DC's Batman Universe - With the Belfry as their base of operations, this new era of heroes will solve mysteries that connect the darkest chapters in Gotham's history - from its soaring towers to its underground criminal network. Embark on rich storylines, including face-offs against some of the most infamous DC Super-Villains, such as Mr. Freeze, who is set on engulfing Gotham City in ice, and the mysterious Court of Owls, a secret society made up of Gotham City's wealthiest families. Explore and Fight Crime in an Open-World Gotham City - Patrol the dark streets of five distinct boroughs in a dynamic, interactive Gotham using a variety of traversal abilities and heroic combat moves, as well as the iconic Batcycle. From street-level crimefighting to face-offs with iconic DC Super-Villains, save the city from descent into chaos. Unique Character Abilities and Customization - Each hero has unique abilities, gear, weapons and a customizable suit. Batgirl wields her melee tonfa Nightwing uses his signature dual escrima sticks; Red Hood has trained to reach peak human strength; and Robin is expertly skilled with his collapsible quarter staff. Team Up in Two-Player, Online Co-Op - Play Gotham Knights solo or team up with a friend and combine strengths to protect Gotham City in two-player, online co-op.",
            "targetPrice": 299.99,
            "walmartPrice": 221.66,
            "costcoPrice": 219.00,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcR43YLgbQvSpXJMC6xqU2ZzGjgWTojSj4dvzziXQZhla6XBBDT-7bHDTOrbdLAWmEV82IPg1KOyseVG4f7-p1B9-wSej9EW0ZicM8Tx3qlnmLPA9dorSa8v-A"
        },
        {
            "name": "God of War Ragnarok: Jotnar Edition PlayStation 5",
            "Description": "Embark on an epic and heartfelt journey as Kratos and Atreus struggle with holding on and letting go. Against a backdrop of Norse Realms torn asunder by the fury of the Aesir, they've been trying their utmost to undo the end times. But despite their best efforts, Fimbulwinter presses onward. Witness the changing dynamic of the father-son relationship as they fight for survival; Atreus thirsts for knowledge to help him understand the prophecy of “Loki”, as Kratos struggles to break free of his past and be the father his son needs. See for yourself how fate will force a choice upon them: between their own safety or the safety of the realms. All the while, hostile Asgardian forces assemble... Venture through all Nine Realms towards the prophesied battle that will end the world. Vanquish Norse gods and monsters alike in fluid, expressive combat. Explore in wonder through stunning mythological landscapes.",
            "targetPrice": 407.00,
            "walmartPrice": 304.00,
            "costcoPrice": 359.95,
            "image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcTIHwhWjfCGZgsVTjnmFC8umFino7Xi1XuKDAc-Z1__1IhpRDSzYMl4aR9esXkTQR2nud3B4iWqxxfVsdN0eKPgHJj33PtZPseRmsLSSz8A2ceggHhcCWyR"
        },
        {
            "name": "Ghost of Tsushima Director's Cut PlayStation 5",
            "Description": "In the late 13th century, the Mongol empire has laid waste to entire nations along their campaign to conquer the East. Tsushima Island is all that stands between mainland Japan and a massive Mongol invasion fleet led by the ruthless and cunning general, Khotun Khan. As the island burns in the wake of the first wave of the Mongol assault, courageous samurai warrior Jin Sakai stands resolute. As one of the last surviving members of his clan, Jin is resolved to do whatever it takes, at any cost, to protect his people and reclaim his home. He must set aside the traditions that have shaped him as a warrior to forge a new path, the path of the Ghost, and wage an unconventional war for the freedom of Tsushima.",
            "targetPrice": 54.99,
            "walmartPrice": 55.97,
            "costcoPrice": 59.00,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcTSpWNNnaYvXdziepwVBEg6yB9F_BqihZWvA6yLjgcO5sJbiGoTMQ5GDGvCc3wivwkod4R1qCBrG6Uy3IElR5FB7QjImu9YBg&usqp=CAY"
        },
        {
            "name": "Pokemon Sword",
            "Description": "Pokémon Sword and Pokémon Shield, the newest additions to the main series of Pokémon RPGs, are coming to Nintendo Switch in late 2019! Introducing the Galar region Get ready to discover Galar, an expansive region with diverse environments, from a peaceful countryside and contemporary cities to a thick forest and snow-covered mountains. The people and Pokémon who live here work together closely to develop the industries within it. Throughout your journey, you'll have the opportunity to visit various Gyms in your quest to become Champion! You won't be alone though, as Galar is home to newly discovered Pokémon that you can choose to be your very first partner! Meet your first partner Pokémon! Your adventure in Pokémon Sword and Pokémon Shield begins when you choose one of three new Pokémon! Grookey, a Grass-type Chimp Pokémon, is mischievous and full of boundless curiosity. Bursting with energy is Scorbunny, a Fire-type Rabbit Pokémon who's always running about. The stealthy Sobble, a Water-type Water Lizard Pokémon, shoots out attacks as it hides itself in water.",
            "targetPrice": 53.89,
            "walmartPrice": 93.53,
            "costcoPrice": 59.99,
            "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcQmKHxI-U9JoH3kyqQbmoipxgjBcx0QXhVf-mYIMlaT0QpSja_WkrM4EBlv6MFh_GD9g9V7Q95G3ivThZ69IuhmNl0d49LZenqRsCmsC-g"
        },
        {
            "name": "Super Smash Bros. Ultimate",
            "Description": "New fighters, like Inkling from the Splatoon series and Ridley from the Metroid series, make their Super Smash Bros. series debut alongside every Super Smash Bros. fighter in the series. Fast combat, new items, new attacks, new defensive options, and more will keep the battle raging whether you're at home or on the go. Reviews",
            "targetPrice": 59.99,
            "walmartPrice": 70.94,
            "costcoPrice": 54.99,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcQVtMTD8RUAz9bXEPca-0IowC14WC0pc3biRU1O6J9Ycs48sAhUDMxFWHBMYahjzuZ1xD3SdeZsWRADzEyeVHAp9gmdj9HRhw&usqp=CAY"
        },
        {
            "name": "Call of Duty: Modern Warfare II: C.o.d.e. Edition",
            "Description": "Welcome to the new era of Call of Duty. Call of Duty: Modern Warfare II is the sequel to 2019s blockbuster Modern Warfare. Featuring the return of the iconic, team leader Captain John Price, the fearless John Soap MacTavish, the seasoned Sergeant Kyle Gaz Garrick, and the lone wolf himself, fan favorite Simon Ghost Riley, players will witness what makes Task Force 141 the legendary squad it is today. From small-scale, high-stakes infiltration tactics to highly classified missions, players will need to leverage new weapons, vehicles, and cutting-edge equipment to take on their enemies. Gear up and take the fight offshore as you siege enemies underwater, breach a highly fortified enemy base, infil along the canals, and liberate much-needed allies at a black site hidden within the mountains. Infinity Ward will immerse fans in heart-pounding next-gen, state-of-the-art gameplay. Fight alongside friends in a truly immersive experience with stunningly realistic sound, lighting, and graphics that produce the most advanced Call of Duty in history. Modern Warfare II will feature a rebuilt, advanced AI system, enhanced rendering and photogrammetry technology, a new Gunsmith system, allowing for more customization than ever before, and a suite of other gameplay and graphical innovations that elevate the franchise to new heights. The future of the franchise is filled with trail blazing innovations and sets the foundation for next-generation gameplay. Modern Warfare II will feature a massive amount of content from day 1 squad up and fight alongside TF141 in a globe-trotting single-player campaign, play lone-gun or rally with your team in immersive multiplayer combat, complete with new locales and ways to play, and experience an evolved, narrative-driven Special Ops game mode featuring tactical co-op gameplay. Additionally, Modern Warfare II connects with the new Warzone experience releasing this year, and with it, the evolution in Battle Royale with a brand-new play space and sandbox mode. Expect a massive calendar of free content post-launch featuring evolving gameplay with new maps, modes, seasonal events, community celebrations and more. Stay Frosty.",
            "targetPrice": 65.00,
            "walmartPrice": 75.00,
            "costcoPrice": 59.99,
            "image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcTea2XFV7KaiU3bjOaqklQTRV42rpKC6VC9VHslcCwCnojJBnW2vK28c6o5ZrjSX9DH3wKniVem01hJ_10bG4x_w97nLx5FuQ"
        },
        {
            "name": "Marvel Holiday Funko Advent Calendar 2022",
            "Description": "Take your holidays to new heights with the Marvel Funko Advent Calendar! Spider-Man is swinging by to deliver 24 unique Funko Pocket Pops! as you count down to your winter festivities.Open the tiny doors to reveal some of your favorite Marvel characters dressed in their holiday finest. Each collectible brings a festive twist to their typical look, making these heroes and villains a super addition to your holiday décor. Who will team up to join in on your celebrations? Pocket Pop! collectibles vary in height depending on character. The maximum collectible height is approximately 2.25-inches tall.",
            "targetPrice": 36.49,
            "walmartPrice": 50.00,
            "costcoPrice": 79.99,
            "image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcS24iy01mDFcHaLqa3iXqoP-x0jPoQL9dEfIXooJu9-QWjFMCNQ_VJnxuNYpWmR5V6v19B4ZTBK2ebLUufXw185Y1ecQAIn1q9ubrgy06hQ24uV3QiTgY5HHw"
        },
        {
            "name": "Funko Pop! 2022 Harry Potter Advent Calendar",
            "Description": "With a flick of his wand, Harry Potter is setting a scene for some holiday fun! The Harry Potter Funko Advent Calendar summons some beloved Wizarding World companions to help you count down to your winter celebrations.Open the tiny doors to reveal 24 unique Funko Pocket Pops! featuring Harry and his friends. Place them in front of the packaging's artwork to create an enchanting scene in Diagon Alley. Who will join in on your holiday adventures? Pocket Pop! collectibles vary in height depending on character. The maximum figure height is approximately 1.87-inches tall.",
            "targetPrice": 57.99,
            "walmartPrice": 39.99,
            "costcoPrice": 38.99,
            "image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcS9hRfRAsZEWbLyXKW7TjAOCyAogvEzQb5CcBlhzTHjCX8FhtThJQdR7Yg9nuTkKXED9TKZppWwc6-6Werh0BPQZrOv_vhAh_k0SbLgc2_LpPj8qoDrzkz8"
        },
        {
            "name": "Lego Harry Potter Hogwarts Castle",
            "Description": "Children and adults alike can harness the power of the wizarding world with the LEGO Harry Potter Hogwarts Castle replica. This highly detailed LEGO Harry Potter collectible castle kit has over 6,000 pieces and offers a rewarding castle building experience in a fantasy realm. It comes packed with highlights from the Harry Potter set where you will discover towers, turrets, chambers, classrooms, creatures, and iconic Harry Potter characters. This Harry Potter Castle building kit comes equipped with 4 characters from the Harry Potter houses as well as 27 microfigures making it perfect for imaginative play for younger crowds, and an excellent Harry Potter gift for older fans. Size: 6020. Color: Multicolor. Gender: unisex.",
            "targetPrice": 399.99,
            "walmartPrice": 350.00,
            "costcoPrice": 399.99,
            "image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcQkIIGikhN5AecDlz7msE0HUVf1Bc9EJjX8cEsAPZnG-PUGbO1nmLOSSAJ1hKBk_cDJuR5qn5vlYpHNB2Szl5P3erF0YizYR02BhC1jXLPI1QcxrttemI_1"
        }
    ],
    "Beauty": [
        {
            "name": "Nyx Professional Makeup Glitter Goals Liquid Lipstick - Reflector",
            "Description": "Shift just got real with the brand-new Glitter Goals Liquid Lipstick. Available in nine transformative tones, this matte liquid lipstick glides on metallic and switches to a stunning glitter finish. Here's how to make the magic happen: Swipe on the smooth shade you cant get enough of and let it set. Then simply smack your lips together to spark the twinkly twist. (Yep, its super-duper easy!) The dazzling effect might just inspire you to go for a glitter lip every single day.",
            "targetPrice": 8.50,
            "walmartPrice": 7.99,
            "costcoPrice": 8.25,
            "Image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcSjoVhSYNOZTm4HVC_kjyU_wX5aDjFTu5y0bdUQep1OOfof5Ko7rOQzS2X-gZvvy-tr0_Wofj7ZT-Q4hoPQJkmmeOfRY74TitfAFlR1kIcNypNb7XWVw0o1hw&usqp=CAE"
        },
        {
            "name": "Nyx Professional Makeup Glitter Goals Liquid Lipstick - Alienated",
            "Description": "Shift just got real with the brand-new Glitter Goals Liquid Lipstick. Available in nine transformative tones, this matte liquid lipstick glides on metallic and switches to a stunning glitter finish. Here's how to make the magic happen: Swipe on the smooth shade you cant get enough of and let it set. Then simply smack your lips together to spark the twinkly twist. (Yep, its super-duper easy!) The dazzling effect might just inspire you to go for a glitter lip every single day.",
            "targetPrice": 8.50,
            "walmartPrice": 7.99,
            "costcoPrice": 8.25,
            "Image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcQwtKC3JO4KCFuelQ8dj0-V2Jy6kcCoRTq9BCQJXohPUYGCwQQTK71ppEIasN6jmzCPAOlyvWc5aeFxmuVHiLy6SK2WuVnORn9FU-2XeKxQlC0BwEv1IhjP"
        },
        {
            "name": "Nyx Professional Makeup Glitter Goals Liquid Lipstick - Amethyst Vibes",
            "Description": "Shift just got real with the brand-new Glitter Goals Liquid Lipstick. Available in nine transformative tones, this matte liquid lipstick glides on metallic and switches to a stunning glitter finish. Here's how to make the magic happen: Swipe on the smooth shade you cant get enough of and let it set. Then simply smack your lips together to spark the twinkly twist. (Yep, its super-duper easy!) The dazzling effect might just inspire you to go for a glitter lip every single day.",
            "targetPrice": 8.50,
            "walmartPrice": 7.99,
            "costcoPrice": 8.25,
            "Image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcR4QDsQUfr9BXi1Bhb0RaJcNY7iX3M8bNyXrhfTzgzS7j1Nwp7eQxkkUqOnOWPzvky7jbdVd6WNvWPUpbDpXLWOo16vdrJi_hoP-mmmnZHPa1_Jj7ZjP-Aq1A"
        },
        {
            "name": "Nyx Professional Makeup Glitter Goals Liquid Lipstick - Cherry Quartz",
            "Description": "Shift just got real with the brand-new Glitter Goals Liquid Lipstick. Available in nine transformative tones, this matte liquid lipstick glides on metallic and switches to a stunning glitter finish. Here's how to make the magic happen: Swipe on the smooth shade you cant get enough of and let it set. Then simply smack your lips together to spark the twinkly twist. (Yep, its super-duper easy!) The dazzling effect might just inspire you to go for a glitter lip every single day.",
            "targetPrice": 8.50,
            "walmartPrice": 7.99,
            "costcoPrice": 8.25,
            "Image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcSjddus0c-vLZDQQHBFWOFuq034ef8VRna88ArasZlsPXXitW8_T8r-K-0hRQtcC9uxXS0gnxCO33rYk8MyULf-zMDl1o30rEzxCvOugyBsFUZ3yHS1EBL5"
        },
        {
            "name": "LOreal Paris Dream Lengths Shampoo & Conditioner Kit",
            "Description": "Long hair? Help seal split ends with elvive Dream Lengths. Formulated with a cocktail of vitamins and fine castor oil, elvive Dream Lengths strengthens hair's length. Dream Lengths restoring shampoo visibly repairs damage without weight down, Dream Lengths super Detangler conditioner instantly detangles to reduce breakage and Dream Lengths no haircut cream leave in conditioner helps seal split ends.",
            "targetPrice": 15.99,
            "walmartPrice": 15.99,
            "costcoPrice": 25.93,
            "Image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcT-fAi9JjwTDf65_YuQ8p5SG4SOWc_8JdPbQnjQ0pi4XeJqg4SVBJ1ecg5g3F7qOABMjnuGhwpD7nBpudZ7zXp55M-PGAbCWqjHlDTebGHUpZQaU55vgUvO"
        },
        {
            "name": "Monday Haircare Volume Shampoo + Conditioner Bundle",
            "Description": "Monday Haircare's Volume range is an invigorating and volumizing Shampoo and Conditioner set that utilizes natural ingredients to thoroughly cleanse and lightly moisturize hair without weighing it down. Volume is specially formulated for thin, fine, flat and oily hair, especially straight or gently wavy hair types. It contains no SLS (Sodium Lauryl Sulfate) or parabens, is vegan and cruelty-free, including being certified by PETA as not being tested on animals. Monday Haircare's Volume range was named \"Best Shampoo and Conditioner for Fine Hair\" in the 2021 Cosmo Holy Grail Beauty Awards.",
            "targetPrice": 34.09,
            "walmartPrice": 24.78,
            "costcoPrice": 49.25,
            "Image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcSS4trnaY7CxWDFAS9HYV0nBQiFT80BiIyRjrT_ZFKU6Em-EYCIBtz2OUpdZwzIk_76q616n7UMrvi1hWzq1bRkg4gsysZ0MUG4iDV5Hyou6lIOffFdkdlBvw"
        },
        {
            "name": "Peach & Lily Glass Skin Discovery Kit",
            "Description": "Peach & Lily have helped many achieve the look of glass skin, no matter their skin type. Our Korean Glass Skin Kit is a unique 4 step routine that helps achieve glass skin.",
            "targetPrice": 39.99,
            "walmartPrice": 15.99,
            "costcoPrice": 39.99,
            "Image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcT50AYaU0Y138S2NO7E3vz1NKX7d0VJNynmHKPSn5FWdWODiqHA7IiGVeZlQGfNUh4N2m5e8cFZeDmcCGbvmc4CM8GiPnvbElEXUMHYbksYNWkYW9VyUcHBHA"
        },
        {
            "name": "Truly Unicorn Fruit Body Butter",
            "Description": "The Unicorn Fruit Body Butter by Truly is a clean, multi-colored, whipped, body butter that smells so delicious you'll want to eat it!? Sign me up! It doesn't end there though - this product is packed with 4 of Truly's favorite ingredients: Matcha, Acai, Chia, Rose.",
            "targetPrice": 25.99,
            "walmartPrice": 23.99,
            "costcoPrice": 35.96,
            "Image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcQrxKqEJAk6x-BbDf9xb1EynaAA09fjNFdFcnL24uYyvu2Ft_czzWgIJbY0UtSCMA1ezdBwUZIEo-bowTo53gvJJqUOW61tBOwb3BiPoa7EtKAjGZ6N7UVr"
        },
        {
            "name": "MVP Skin Routine",
            "Description": "MVP Skin Routine - Enjoy ULTA's MVP Skin Routine this seasons with the most talked about samples for men with some awesome reviews! Includes Bill Jealousy - Leave-in-Conditioner (0.5 oz) Clinique For Men - Face Scrub (0.5 oz) Jack Black - Turbo Wash Energizing Cleanser (1.0 oz) Kiehl's - Ultra Facial Cleanser (1.0 oz) Mario Badescu - Gentle Foaming Cleanser (1.0 oz) ProActiv - Skin Purifying Mask (0.33 oz) StriVectin - Anti-Wrinkle Intensive Eye Concentrate Plus for Winkles (0.025 oz) Sunday Riley - U.F.O. Ultra-Clarifying Acne Treatment Face Oil (0.17 oz) Tula - The Cult Classic Purifying Face Cleanser (1.0 oz) - MVP Skin Routine",
            "targetPrice": 15.99,
            "walmartPrice": 14.99,
            "costcoPrice": 15.99,
            "Image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcRZJZ9wb9xVEdQWclBv542Z7wiVvPU5m879jOmRDv6FKBopGopmxaygRKmpvdykrFUx0QNjqEiBJ004yQnzxloBF1gLUJt3Uw&usqp=CAY"
        },
        {
            "name": "The Ordinary Niacinamide 10% + Zinc 1% 30ml",
            "Description": "Niacinamide (vitamin B3) reduces skin irritation and trouble. The 10% high-concentration vitamin in this formula balances skin sebum activity with the zinc salt of pyrrolidone carboxylic acid. [How to use] Before morning and before you go to bed, apply your face over the face before using heavy cream type products. Caution - This product should not be used concurrently with other vitamin C-related skin care products.",
            "targetPrice": 10.99,
            "walmartPrice": 6.50,
            "costcoPrice": 7.99,
            "Image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcQQ3cJsht8WyJNF3eDr5IgvrVo2B9XU87STuKcRXt5DlltiFP0moTvDD9OLv9N7J0Zxqp4jREI2OfCFoJlKsu0p6Q_e9GLm9TYez_leeuk5"
        },
        {
            "name": "Discovery Kit - 12 pc. Natural Skin Care Samples",
            "Description": "",
            "targetPrice": 11.75,
            "walmartPrice": 12.98,
            "costcoPrice": 11.28,
            "Image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcQEXmjtHaO5F6dQl9r0bzIGwjoqzB100wXoLbOlCjxFSxwtVkUNvsWjaeXVwie9gTbKMG55PMTFKvOlrpdKYchohUgI3jrWFN1GzfY4bCASmnXjvqKJxlHkcg"
        },
        {
            "name": "Laneige Hydrate & Snooze Set",
            "Description": "A limited-edition set of ultra-hydrating morning and evening essentials, including Laneige's bestselling icons.",
            "targetPrice": 32.65,
            "walmartPrice": 31.99,
            "costcoPrice": 30.97,
            "Image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcROyGbg7qrPW02djVE-KILeoEbwkiqVaddJ9qr9Lqa8ZBon-V60PxyE9p90UgZRZfY_SWv5SihAPzlNJxetAC7O7Np-_4LBedvLeLPWt74uiuSynK5MagaT"
        },
        {
            "name": "Mantl The Daily Routine Set",
            "Description": "Confused about skincare? MANTL's Complete Routine has everything you need assembled in one convenient kit. This award-winning skincare is designed for the modern man with simple, thoughtfully formulated products that help cleanse, moisturize, and protect your skin from morning to night. The Complete Routine includes a 90 day supply of all their skincare essentials for a complete regimen you can rely on: The gentle, aloe-based Face + Scalp Cleanser you can use day and night to clean, soothe, and hydrate skin without overstripping. Aloe hydrates and calms irritated skin, while allantoin combats dryness and willow herb extract helps manage excess oil for balanced skin. This Soft, foaming gel also features a light, woodsy citrus scent to leave you feeling refreshed. Follow that with the Age Defense Moisturizer to hydrate and balance skin. Formulated with vitamin B3 (Niacinamide) and willow herb extract, this lightweight moisturizer minimizes redness and fortifies the skin's barrier from environmental stressors. The addition of antioxidant-rich squalane helps prevent moisture loss and defends against fine lines. Before you head out the door, apply the Invisible Daily SPF 30 moisturizer. Winner of Esquire's Best SPF of the Year, this transparent, no-shine, no-streak SPF is suitable for all skin types. It's fortified with ginger root to help improve skin texture, willow herb extract to manage excess oil, and fatty acids to fortify skin's barrier and maintain hydration. If you notice a shine developing throughout the day, you can use the No Shine Sheets with bamboo charcoal to instantly neutralize excess oil and absorb shine for a refreshed, clean look. Use anytime, anywhere with the refillable, compact dispenser.",
            "targetPrice": 114.00,
            "walmartPrice": 97.00,
            "costcoPrice": 70.00,
            "Image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcRdhAO2NbDsyLhFomeEXtCAy1Mek6h9zm97O3GVmD7jGqkBLrrnpn6Ds17gQwimY51fwgIzHHaud1h54yykljKNSAvMX9SPU73Szc7Bo1pe8eHPesDVNSJbYQ"
        },
        {
            "name": "Daily Skincare Facial Bundle - Hydrating Facial Cleanser ",
            "Description": "The perfect skincare routine is finally here. These are for daily use and will keep your face moisturized and helps restore protective skin barrier.",
            "targetPrice": 43.20,
            "walmartPrice": 42.99,
            "costcoPrice": 35.99,
            "Image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcTuIfsPvdpPGaR87BWQFz6FKLEfdMSDHDw-vSMVi1e5fhNSu7X0Q75JJVpvsch1VSe-rQE1dumNRHdE8u2TC066G8aqXd9FDZNs_MVjWbC84pTdDNChyY3-Pw"
        },
        {
            "name": "SKKN by Kim The Complete Collection Set",
            "Description": "Radiant and rejuvenated skin begins with The Complete Collection. Through clean and uncompromising formulas, all nine products work together to nourish, smooth, and hydrate the skin for a long-lasting glow.",
            "targetPrice": 499.99,
            "walmartPrice": 450.99,
            "costcoPrice": 475.99,
            "Image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcRWNXGc0GAEj76fuO6L87AzvtkPtEXaUw5dFF0zYASdtEulkIRnaAr1kv_m9zecksCwmZDn9KDBsbJJu2w5DH1YlkVFXc814_KHRuJ1b9pdhH_HWANtQMSRlZI"
        },
        {
            "name": "ClarityRx Skincare Essentials Kit",
            "Description": "ClarityRx must-have products designed to give your complexion a healthy boost and leave your skin clean, glowing and protected.",
            "targetPrice": 24.12,
            "walmartPrice": 25.50,
            "costcoPrice": 24.99,
            "Image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcSTIRi0NVl5ztDvNUkMk4S1ETpRkxbw4RtZFwdZ3crjlm2cgeqdMIlkB4Ko9TcYnR1xJ2ah9QuIAsh2qg39S790y-m916YesZ81-JNoEtxu96fhM83M2Y6z"
        },
        {
            "name": "Bio-Oil Skincare Oil - 2 fl oz",
            "Description": "Bio-Oil is a skincare oil developed to help improve the appearance of scars and stretch marks. Its advanced formulation also makes it extremely effective for numerous other skin concerns. It helps promote even skin tone, nourishes ageing skin and provides intensive lubrication to dry, flaky skin. Bio-Oil is a rapidly absorbed 'dry' oil and leaves no oily residue. Bio-Oil contains the unique ingredient PurCellin Oil, vitamins A and E, Calendula, Lavender and Rosemary oils and Chamomile extract. It contains no preservatives and is suitable for all skin types. ScarsHelps reduce the appearance of both new and old scars, whether caused by surgery, accidents, burns or insect bites. It is also highly effective for helping to reduce the feeling of tightness where scars are on high mobility areas. Stretch marksHelps prevent the appearance of stretch marks during periods of rapid change in body size such as pregnancy, adolescence and sudden weight loss/gain. Helps reduce the appearance of exis Bio-Oil Skincare Oil 60ml",
            "targetPrice": 8.92,
            "walmartPrice": 9.72,
            "costcoPrice": 8.99,
            "Image": "https://encrypted-tbn2.gstatic.com/shopping?q=tbn:ANd9GcQTKXpBmJTB0VHnuo8Q7NAQI2HQBlQA3Mq33oH6cwDeAXwnNO69Kxd2v-XL1DQCCZwqtmEP0xbZgl8DHNYT5on04bJHLN2897XvSqiE7Ykv9AtjXn_nMXoHQAQ"
        },
        {
            "name": "Glow Recipe Hey You, You're Glowing Watermelon Set",
            "Description": "Like a dream come true for visible pores that seem to poke out at every occasion, the Hey You, You're Glowing set combines the radiance-boosting powers not one but two full sized sought-after staples — the alcohol-free Watermelon Glow PHA + BHA Pore-Tight Toner which helps to decongest and tone for a practically poreless-looking complexion and the Watermelon Glow Niacinamide Dew Drops, a natural skin-strobing formula. Both starring the hero ingredient acclaimed by Korean beauty buffs - watermelon extract - for its ability to soothe irritated and inflamed skin with luscious, skin-restoring vitamins, antioxidants and amino acids. Targeting congestion and pore-clogging foes, the toning solution gently buffs away dead skin cells whilst this glow-giving serum restores your Instagram-ready radiance with just a few pumps. The results? Why supple, smooth and glowing skin, of course.",
            "targetPrice": 49.90,
            "walmartPrice": 49.99,
            "costcoPrice": 50.00,
            "Image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcRLOrmFfR6q5pIXnX9P04ASOY8gB2Ifey6TBKaCVUnivXRbXeD2RbXR3_4tcrjCUFqUCIaif7ZqfREE0aSwcgUEwbHl5YAj-01-ZK6RSMGfjkNe5pF99MFF"
        },
        {
            "name": "Estée Lauder Glow authorities Repair & Nourish Skincare Set",
            "Description": "You're good to glow with these daily skincare essentials for stronger, radiant, deeply hydrated, healthier-looking skin. A daily regimen gift set including deluxe travel sizes of some of Estée Lauders best-selling formulas for glowing skin. Limited-time collection includes: Advanced Night Repair Serum Synchronized Multi-Recovery Complex, deluxe travel size (.24 oz./7ml). Revitalizing Supreme+ Youth Power Creme, deluxe travel size (.5 oz./15ml). Revitalizing Supreme+ Night Intensive Restorative Creme, deluxe travel size (.5 oz./15ml). Revitalizing Supreme+Youth Power Eye Balm, deluxe travel size (.17 oz./5ml).",
            "targetPrice": 42.50,
            "walmartPrice": 49.99,
            "costcoPrice": 47.98,
            "Image": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcTEJxk-3jsqP-x-5eWGPFxCU_nLTBLNVLla3dH4jG5XY3CDXKVWTOJdl3AZnUMCG4yVFttaBaH2bHHA8mDC0SqbMjUrBJSR_3BBkQLHPrLutveMGDJ4SqCoWg"
        },
        {
            "name": "CeraVe Skin Barrier Restoring Kit for Acne Prone Skin",
            "Description": "No harsh microbeads that can irritate skin or damage the environment Helps restore the protective skin barrier with three essential ceramides Helps attract moisture to the skin with hyaluronic acid Helps soothe the skin with niacinamide Enriched with antioxidant vitamin D Suitable for face and body, as well as acne-prone skin Non-comedogenic Fragrance Free Allergy-tested Developed with dermatologists The CeraVe Skin Barrier Restoring Kit features three essential products for hydrating and refining the appearance of post-acne marks and visible pores.",
            "targetPrice": 45.99,
            "walmartPrice": 43.78,
            "costcoPrice": 35.99,
            "Image": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcTBoBUGu3o499fBGEnJdAF9GJZfJ23fOl-X_NHdWemDg_zvwoKVZTgtr-YmP0BH3yixzZU9dKoeXEz-h2I93CifO1X4DSH-Q6c2Wx13B45AEY5XwVCMjVeNtQ"
        }
    ],
    "Pets": [
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        },
        {
            "name": "",
            "Description": "",
            "targetPrice": 0,
            "walmartPrice": 0,
            "costcoPrice": 0,
            "Image": ""
        }
    ]
}